espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_MCPWM_REG_H_
#define _SOC_MCPWM_REG_H_
#include "soc.h"

#define REG_MCPWM_BASE(i)               (DR_REG_PWM_BASE + i * (0xE000))
#define MCPWM_CLK_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0000)
/* MCPWM_CLK_PRESCALE : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: Period of PWM_clk = 6.25ns * (PWM_CLK_PRESCALE + 1)*/
#define MCPWM_CLK_PRESCALE  0x000000FF
#define MCPWM_CLK_PRESCALE_M  ((MCPWM_CLK_PRESCALE_V)<<(MCPWM_CLK_PRESCALE_S))
#define MCPWM_CLK_PRESCALE_V  0xFF
#define MCPWM_CLK_PRESCALE_S  0

#define MCPWM_TIMER0_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x0004)
/* MCPWM_TIMER0_PERIOD_UPMETHOD : R/W ;bitpos:[25:24] ;default: 2'd0 ; */
/*description: Update method for active reg of PWM timer0 period  0: immediate
  1: TEZ  2: sync  3: TEZ or sync. TEZ here and below means timer equal zero event*/
#define MCPWM_TIMER0_PERIOD_UPMETHOD  0x00000003
#define MCPWM_TIMER0_PERIOD_UPMETHOD_M  ((MCPWM_TIMER0_PERIOD_UPMETHOD_V)<<(MCPWM_TIMER0_PERIOD_UPMETHOD_S))
#define MCPWM_TIMER0_PERIOD_UPMETHOD_V  0x3
#define MCPWM_TIMER0_PERIOD_UPMETHOD_S  24
/* MCPWM_TIMER0_PERIOD : R/W ;bitpos:[23:8] ;default: 16'h00ff ; */
/*description: Period shadow reg of PWM timer0*/
#define MCPWM_TIMER0_PERIOD  0x0000FFFF
#define MCPWM_TIMER0_PERIOD_M  ((MCPWM_TIMER0_PERIOD_V)<<(MCPWM_TIMER0_PERIOD_S))
#define MCPWM_TIMER0_PERIOD_V  0xFFFF
#define MCPWM_TIMER0_PERIOD_S  8
/* MCPWM_TIMER0_PRESCALE : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: Period of PT0_clk = Period of PWM_clk * (PWM_TIMER0_PRESCALE + 1)*/
#define MCPWM_TIMER0_PRESCALE  0x000000FF
#define MCPWM_TIMER0_PRESCALE_M  ((MCPWM_TIMER0_PRESCALE_V)<<(MCPWM_TIMER0_PRESCALE_S))
#define MCPWM_TIMER0_PRESCALE_V  0xFF
#define MCPWM_TIMER0_PRESCALE_S  0

#define MCPWM_TIMER0_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x0008)
/* MCPWM_TIMER0_MOD : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: PWM timer0 working mode  0: freeze  1: increase mod  2: decrease
 mod  3: up-down mod*/
#define MCPWM_TIMER0_MOD  0x00000003
#define MCPWM_TIMER0_MOD_M  ((MCPWM_TIMER0_MOD_V)<<(MCPWM_TIMER0_MOD_S))
#define MCPWM_TIMER0_MOD_V  0x3
#define MCPWM_TIMER0_MOD_S  3
/* MCPWM_TIMER0_START : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: PWM timer0 start and stop control. 0: stop @ TEZ  1: stop @ TEP
  2: free run  3: start and stop @ next TEZ  4: start and stop @ next TEP. TEP here and below means timer equal period event*/
#define MCPWM_TIMER0_START  0x00000007
#define MCPWM_TIMER0_START_M  ((MCPWM_TIMER0_START_V)<<(MCPWM_TIMER0_START_S))
#define MCPWM_TIMER0_START_V  0x7
#define MCPWM_TIMER0_START_S  0

#define MCPWM_TIMER0_SYNC_REG(i)          (REG_MCPWM_BASE(i) + 0x000c)
/* MCPWM_TIMER0_PHASE : R/W ;bitpos:[20:4] ;default: 17'd0 ; */
/*description: Phase for timer reload on sync event*/
#define MCPWM_TIMER0_PHASE  0x0001FFFF
#define MCPWM_TIMER0_PHASE_M  ((MCPWM_TIMER0_PHASE_V)<<(MCPWM_TIMER0_PHASE_S))
#define MCPWM_TIMER0_PHASE_V  0x1FFFF
#define MCPWM_TIMER0_PHASE_S  4
/* MCPWM_TIMER0_SYNCO_SEL : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: PWM timer0 synco selection  0: synci  1: TEZ  2: TEP  else 0*/
#define MCPWM_TIMER0_SYNCO_SEL  0x00000003
#define MCPWM_TIMER0_SYNCO_SEL_M  ((MCPWM_TIMER0_SYNCO_SEL_V)<<(MCPWM_TIMER0_SYNCO_SEL_S))
#define MCPWM_TIMER0_SYNCO_SEL_V  0x3
#define MCPWM_TIMER0_SYNCO_SEL_S  2
/* MCPWM_TIMER0_SYNC_SW : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: Toggling this bit will trigger a software sync*/
#define MCPWM_TIMER0_SYNC_SW  (BIT(1))
#define MCPWM_TIMER0_SYNC_SW_M  (BIT(1))
#define MCPWM_TIMER0_SYNC_SW_V  0x1
#define MCPWM_TIMER0_SYNC_SW_S  1
/* MCPWM_TIMER0_SYNCI_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: When set   timer reload with phase on sync input event is enabled*/
#define MCPWM_TIMER0_SYNCI_EN  (BIT(0))
#define MCPWM_TIMER0_SYNCI_EN_M  (BIT(0))
#define MCPWM_TIMER0_SYNCI_EN_V  0x1
#define MCPWM_TIMER0_SYNCI_EN_S  0

#define MCPWM_TIMER0_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x0010)
/* MCPWM_TIMER0_DIRECTION : RO ;bitpos:[16] ;default: 1'd0 ; */
/*description: Current PWM timer0 counter direction  0: increment 1: decrement*/
#define MCPWM_TIMER0_DIRECTION  (BIT(16))
#define MCPWM_TIMER0_DIRECTION_M  (BIT(16))
#define MCPWM_TIMER0_DIRECTION_V  0x1
#define MCPWM_TIMER0_DIRECTION_S  16
/* MCPWM_TIMER0_VALUE : RO ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Current PWM timer0 counter value*/
#define MCPWM_TIMER0_VALUE  0x0000FFFF
#define MCPWM_TIMER0_VALUE_M  ((MCPWM_TIMER0_VALUE_V)<<(MCPWM_TIMER0_VALUE_S))
#define MCPWM_TIMER0_VALUE_V  0xFFFF
#define MCPWM_TIMER0_VALUE_S  0

#define MCPWM_TIMER1_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x0014)
/* MCPWM_TIMER1_PERIOD_UPMETHOD : R/W ;bitpos:[25:24] ;default: 2'd0 ; */
/*description: Update method for active reg of PWM timer1 period  0: immediate
  1: TEZ  2: sync  3: TEZ or sync*/
#define MCPWM_TIMER1_PERIOD_UPMETHOD  0x00000003
#define MCPWM_TIMER1_PERIOD_UPMETHOD_M  ((MCPWM_TIMER1_PERIOD_UPMETHOD_V)<<(MCPWM_TIMER1_PERIOD_UPMETHOD_S))
#define MCPWM_TIMER1_PERIOD_UPMETHOD_V  0x3
#define MCPWM_TIMER1_PERIOD_UPMETHOD_S  24
/* MCPWM_TIMER1_PERIOD : R/W ;bitpos:[23:8] ;default: 16'h00ff ; */
/*description: Period shadow reg of PWM timer1*/
#define MCPWM_TIMER1_PERIOD  0x0000FFFF
#define MCPWM_TIMER1_PERIOD_M  ((MCPWM_TIMER1_PERIOD_V)<<(MCPWM_TIMER1_PERIOD_S))
#define MCPWM_TIMER1_PERIOD_V  0xFFFF
#define MCPWM_TIMER1_PERIOD_S  8
/* MCPWM_TIMER1_PRESCALE : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: Period of PT1_clk = Period of PWM_clk * (PWM_TIMER1_PRESCALE + 1)*/
#define MCPWM_TIMER1_PRESCALE  0x000000FF
#define MCPWM_TIMER1_PRESCALE_M  ((MCPWM_TIMER1_PRESCALE_V)<<(MCPWM_TIMER1_PRESCALE_S))
#define MCPWM_TIMER1_PRESCALE_V  0xFF
#define MCPWM_TIMER1_PRESCALE_S  0

#define MCPWM_TIMER1_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x0018)
/* MCPWM_TIMER1_MOD : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: PWM timer1 working mode  0: freeze  1: increase mod  2: decrease
 mod  3: up-down mod*/
#define MCPWM_TIMER1_MOD  0x00000003
#define MCPWM_TIMER1_MOD_M  ((MCPWM_TIMER1_MOD_V)<<(MCPWM_TIMER1_MOD_S))
#define MCPWM_TIMER1_MOD_V  0x3
#define MCPWM_TIMER1_MOD_S  3
/* MCPWM_TIMER1_START : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: PWM timer1 start and stop control. 0: stop @ TEZ  1: stop @ TEP
  2: free run  3: start and stop @ next TEZ  4: start and stop @ next TEP.*/
#define MCPWM_TIMER1_START  0x00000007
#define MCPWM_TIMER1_START_M  ((MCPWM_TIMER1_START_V)<<(MCPWM_TIMER1_START_S))
#define MCPWM_TIMER1_START_V  0x7
#define MCPWM_TIMER1_START_S  0

#define MCPWM_TIMER1_SYNC_REG(i)          (REG_MCPWM_BASE(i) + 0x001c)
/* MCPWM_TIMER1_PHASE : R/W ;bitpos:[20:4] ;default: 17'd0 ; */
/*description: Phase for timer reload on sync event*/
#define MCPWM_TIMER1_PHASE  0x0001FFFF
#define MCPWM_TIMER1_PHASE_M  ((MCPWM_TIMER1_PHASE_V)<<(MCPWM_TIMER1_PHASE_S))
#define MCPWM_TIMER1_PHASE_V  0x1FFFF
#define MCPWM_TIMER1_PHASE_S  4
/* MCPWM_TIMER1_SYNCO_SEL : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: PWM timer1 synco selection  0: synci  1: TEZ  2: TEP  else 0*/
#define MCPWM_TIMER1_SYNCO_SEL  0x00000003
#define MCPWM_TIMER1_SYNCO_SEL_M  ((MCPWM_TIMER1_SYNCO_SEL_V)<<(MCPWM_TIMER1_SYNCO_SEL_S))
#define MCPWM_TIMER1_SYNCO_SEL_V  0x3
#define MCPWM_TIMER1_SYNCO_SEL_S  2
/* MCPWM_TIMER1_SYNC_SW : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: Toggling this bit will trigger a software sync*/
#define MCPWM_TIMER1_SYNC_SW  (BIT(1))
#define MCPWM_TIMER1_SYNC_SW_M  (BIT(1))
#define MCPWM_TIMER1_SYNC_SW_V  0x1
#define MCPWM_TIMER1_SYNC_SW_S  1
/* MCPWM_TIMER1_SYNCI_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: When set   timer reload with phase on sync input event is enabled*/
#define MCPWM_TIMER1_SYNCI_EN  (BIT(0))
#define MCPWM_TIMER1_SYNCI_EN_M  (BIT(0))
#define MCPWM_TIMER1_SYNCI_EN_V  0x1
#define MCPWM_TIMER1_SYNCI_EN_S  0

#define MCPWM_TIMER1_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x0020)
/* MCPWM_TIMER1_DIRECTION : RO ;bitpos:[16] ;default: 1'd0 ; */
/*description: Current PWM timer1 counter direction  0: increment 1: decrement*/
#define MCPWM_TIMER1_DIRECTION  (BIT(16))
#define MCPWM_TIMER1_DIRECTION_M  (BIT(16))
#define MCPWM_TIMER1_DIRECTION_V  0x1
#define MCPWM_TIMER1_DIRECTION_S  16
/* MCPWM_TIMER1_VALUE : RO ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Current PWM timer1 counter value*/
#define MCPWM_TIMER1_VALUE  0x0000FFFF
#define MCPWM_TIMER1_VALUE_M  ((MCPWM_TIMER1_VALUE_V)<<(MCPWM_TIMER1_VALUE_S))
#define MCPWM_TIMER1_VALUE_V  0xFFFF
#define MCPWM_TIMER1_VALUE_S  0

#define MCPWM_TIMER2_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x0024)
/* MCPWM_TIMER2_PERIOD_UPMETHOD : R/W ;bitpos:[25:24] ;default: 2'd0 ; */
/*description: Update method for active reg of PWM timer2 period  0: immediate
  1: TEZ  2: sync  3: TEZ or sync*/
#define MCPWM_TIMER2_PERIOD_UPMETHOD  0x00000003
#define MCPWM_TIMER2_PERIOD_UPMETHOD_M  ((MCPWM_TIMER2_PERIOD_UPMETHOD_V)<<(MCPWM_TIMER2_PERIOD_UPMETHOD_S))
#define MCPWM_TIMER2_PERIOD_UPMETHOD_V  0x3
#define MCPWM_TIMER2_PERIOD_UPMETHOD_S  24
/* MCPWM_TIMER2_PERIOD : R/W ;bitpos:[23:8] ;default: 16'h00ff ; */
/*description: Period shadow reg of PWM timer2*/
#define MCPWM_TIMER2_PERIOD  0x0000FFFF
#define MCPWM_TIMER2_PERIOD_M  ((MCPWM_TIMER2_PERIOD_V)<<(MCPWM_TIMER2_PERIOD_S))
#define MCPWM_TIMER2_PERIOD_V  0xFFFF
#define MCPWM_TIMER2_PERIOD_S  8
/* MCPWM_TIMER2_PRESCALE : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: Period of PT2_clk = Period of PWM_clk * (PWM_TIMER2_PRESCALE + 1)*/
#define MCPWM_TIMER2_PRESCALE  0x000000FF
#define MCPWM_TIMER2_PRESCALE_M  ((MCPWM_TIMER2_PRESCALE_V)<<(MCPWM_TIMER2_PRESCALE_S))
#define MCPWM_TIMER2_PRESCALE_V  0xFF
#define MCPWM_TIMER2_PRESCALE_S  0

#define MCPWM_TIMER2_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x0028)
/* MCPWM_TIMER2_MOD : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: PWM timer2 working mode  0: freeze  1: increase mod  2: decrease
 mod  3: up-down mod*/
#define MCPWM_TIMER2_MOD  0x00000003
#define MCPWM_TIMER2_MOD_M  ((MCPWM_TIMER2_MOD_V)<<(MCPWM_TIMER2_MOD_S))
#define MCPWM_TIMER2_MOD_V  0x3
#define MCPWM_TIMER2_MOD_S  3
/* MCPWM_TIMER2_START : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: PWM timer2 start and stop control. 0: stop @ TEZ  1: stop @ TEP
  2: free run  3: start and stop @ next TEZ  4: start and stop @ next TEP.*/
#define MCPWM_TIMER2_START  0x00000007
#define MCPWM_TIMER2_START_M  ((MCPWM_TIMER2_START_V)<<(MCPWM_TIMER2_START_S))
#define MCPWM_TIMER2_START_V  0x7
#define MCPWM_TIMER2_START_S  0

