espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_TIMER2_SYNC_REG(i)          (REG_MCPWM_BASE(i) + 0x002c)
/* MCPWM_TIMER2_PHASE : R/W ;bitpos:[20:4] ;default: 17'd0 ; */
/*description: Phase for timer reload on sync event*/
#define MCPWM_TIMER2_PHASE  0x0001FFFF
#define MCPWM_TIMER2_PHASE_M  ((MCPWM_TIMER2_PHASE_V)<<(MCPWM_TIMER2_PHASE_S))
#define MCPWM_TIMER2_PHASE_V  0x1FFFF
#define MCPWM_TIMER2_PHASE_S  4
/* MCPWM_TIMER2_SYNCO_SEL : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: PWM timer2 synco selection  0: synci  1: TEZ  2: TEP  else 0*/
#define MCPWM_TIMER2_SYNCO_SEL  0x00000003
#define MCPWM_TIMER2_SYNCO_SEL_M  ((MCPWM_TIMER2_SYNCO_SEL_V)<<(MCPWM_TIMER2_SYNCO_SEL_S))
#define MCPWM_TIMER2_SYNCO_SEL_V  0x3
#define MCPWM_TIMER2_SYNCO_SEL_S  2
/* MCPWM_TIMER2_SYNC_SW : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: Toggling this bit will trigger a software sync*/
#define MCPWM_TIMER2_SYNC_SW  (BIT(1))
#define MCPWM_TIMER2_SYNC_SW_M  (BIT(1))
#define MCPWM_TIMER2_SYNC_SW_V  0x1
#define MCPWM_TIMER2_SYNC_SW_S  1
/* MCPWM_TIMER2_SYNCI_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: When set   timer reload with phase on sync input event is enabled*/
#define MCPWM_TIMER2_SYNCI_EN  (BIT(0))
#define MCPWM_TIMER2_SYNCI_EN_M  (BIT(0))
#define MCPWM_TIMER2_SYNCI_EN_V  0x1
#define MCPWM_TIMER2_SYNCI_EN_S  0

#define MCPWM_TIMER2_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x0030)
/* MCPWM_TIMER2_DIRECTION : RO ;bitpos:[16] ;default: 1'd0 ; */
/*description: Current PWM timer2 counter direction  0: increment 1: decrement*/
#define MCPWM_TIMER2_DIRECTION  (BIT(16))
#define MCPWM_TIMER2_DIRECTION_M  (BIT(16))
#define MCPWM_TIMER2_DIRECTION_V  0x1
#define MCPWM_TIMER2_DIRECTION_S  16
/* MCPWM_TIMER2_VALUE : RO ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Current PWM timer2 counter value*/
#define MCPWM_TIMER2_VALUE  0x0000FFFF
#define MCPWM_TIMER2_VALUE_M  ((MCPWM_TIMER2_VALUE_V)<<(MCPWM_TIMER2_VALUE_S))
#define MCPWM_TIMER2_VALUE_V  0xFFFF
#define MCPWM_TIMER2_VALUE_S  0

#define MCPWM_TIMER_SYNCI_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0034)
/* MCPWM_EXTERNAL_SYNCI2_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: Onvert SYNC2 from GPIO matrix*/
#define MCPWM_EXTERNAL_SYNCI2_INVERT  (BIT(11))
#define MCPWM_EXTERNAL_SYNCI2_INVERT_M  (BIT(11))
#define MCPWM_EXTERNAL_SYNCI2_INVERT_V  0x1
#define MCPWM_EXTERNAL_SYNCI2_INVERT_S  11
/* MCPWM_EXTERNAL_SYNCI1_INVERT : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: Invert SYNC1 from GPIO matrix*/
#define MCPWM_EXTERNAL_SYNCI1_INVERT  (BIT(10))
#define MCPWM_EXTERNAL_SYNCI1_INVERT_M  (BIT(10))
#define MCPWM_EXTERNAL_SYNCI1_INVERT_V  0x1
#define MCPWM_EXTERNAL_SYNCI1_INVERT_S  10
/* MCPWM_EXTERNAL_SYNCI0_INVERT : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: Invert SYNC0 from GPIO matrix*/
#define MCPWM_EXTERNAL_SYNCI0_INVERT  (BIT(9))
#define MCPWM_EXTERNAL_SYNCI0_INVERT_M  (BIT(9))
#define MCPWM_EXTERNAL_SYNCI0_INVERT_V  0x1
#define MCPWM_EXTERNAL_SYNCI0_INVERT_S  9
/* MCPWM_TIMER2_SYNCISEL : R/W ;bitpos:[8:6] ;default: 3'd0 ; */
/*description: Select sync input for PWM timer2  1: PWM timer0 synco  2: PWM
 timer1 synco  3: PWM timer2 synco  4: SYNC0 from GPIO matrix  5: SYNC1 from GPIO matrix  6: SYNC2 from GPIO matrix  other values: no sync input selected*/
#define MCPWM_TIMER2_SYNCISEL  0x00000007
#define MCPWM_TIMER2_SYNCISEL_M  ((MCPWM_TIMER2_SYNCISEL_V)<<(MCPWM_TIMER2_SYNCISEL_S))
#define MCPWM_TIMER2_SYNCISEL_V  0x7
#define MCPWM_TIMER2_SYNCISEL_S  6
/* MCPWM_TIMER1_SYNCISEL : R/W ;bitpos:[5:3] ;default: 3'd0 ; */
/*description: Select sync input for PWM timer1  1: PWM timer0 synco  2: PWM
 timer1 synco  3: PWM timer2 synco  4: SYNC0 from GPIO matrix  5: SYNC1 from GPIO matrix  6: SYNC2 from GPIO matrix  other values: no sync input selected*/
#define MCPWM_TIMER1_SYNCISEL  0x00000007
#define MCPWM_TIMER1_SYNCISEL_M  ((MCPWM_TIMER1_SYNCISEL_V)<<(MCPWM_TIMER1_SYNCISEL_S))
#define MCPWM_TIMER1_SYNCISEL_V  0x7
#define MCPWM_TIMER1_SYNCISEL_S  3
/* MCPWM_TIMER0_SYNCISEL : R/W ;bitpos:[2:0] ;default: 3'd0 ; */
/*description: Select sync input for PWM timer0  1: PWM timer0 synco  2: PWM
 timer1 synco  3: PWM timer2 synco  4: SYNC0 from GPIO matrix  5: SYNC1 from GPIO matrix  6: SYNC2 from GPIO matrix  other values: no sync input selected*/
#define MCPWM_TIMER0_SYNCISEL  0x00000007
#define MCPWM_TIMER0_SYNCISEL_M  ((MCPWM_TIMER0_SYNCISEL_V)<<(MCPWM_TIMER0_SYNCISEL_S))
#define MCPWM_TIMER0_SYNCISEL_V  0x7
#define MCPWM_TIMER0_SYNCISEL_S  0

#define MCPWM_OPERATOR_TIMERSEL_REG(i)          (REG_MCPWM_BASE(i) + 0x0038)
/* MCPWM_OPERATOR2_TIMERSEL : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: Select which PWM timer's is the timing reference for PWM operator2
  0: timer0  1: timer1  2: timer2*/
#define MCPWM_OPERATOR2_TIMERSEL  0x00000003
#define MCPWM_OPERATOR2_TIMERSEL_M  ((MCPWM_OPERATOR2_TIMERSEL_V)<<(MCPWM_OPERATOR2_TIMERSEL_S))
#define MCPWM_OPERATOR2_TIMERSEL_V  0x3
#define MCPWM_OPERATOR2_TIMERSEL_S  4
/* MCPWM_OPERATOR1_TIMERSEL : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: Select which PWM timer's is the timing reference for PWM operator1
  0: timer0  1: timer1  2: timer2*/
#define MCPWM_OPERATOR1_TIMERSEL  0x00000003
#define MCPWM_OPERATOR1_TIMERSEL_M  ((MCPWM_OPERATOR1_TIMERSEL_V)<<(MCPWM_OPERATOR1_TIMERSEL_S))
#define MCPWM_OPERATOR1_TIMERSEL_V  0x3
#define MCPWM_OPERATOR1_TIMERSEL_S  2
/* MCPWM_OPERATOR0_TIMERSEL : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: Select which PWM timer's is the timing reference for PWM operator0
  0: timer0  1: timer1  2: timer2*/
#define MCPWM_OPERATOR0_TIMERSEL  0x00000003
#define MCPWM_OPERATOR0_TIMERSEL_M  ((MCPWM_OPERATOR0_TIMERSEL_V)<<(MCPWM_OPERATOR0_TIMERSEL_S))
#define MCPWM_OPERATOR0_TIMERSEL_V  0x3
#define MCPWM_OPERATOR0_TIMERSEL_S  0

#define MCPWM_GEN0_STMP_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x003c)
/* MCPWM_GEN0_B_SHDW_FULL : RO ;bitpos:[9] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  PWM generator 0 time stamp
 B's shadow reg is filled and waiting to be transferred to B's active reg. If cleared  B's active reg has been updated with shadow reg latest value*/
#define MCPWM_GEN0_B_SHDW_FULL  (BIT(9))
#define MCPWM_GEN0_B_SHDW_FULL_M  (BIT(9))
#define MCPWM_GEN0_B_SHDW_FULL_V  0x1
#define MCPWM_GEN0_B_SHDW_FULL_S  9
/* MCPWM_GEN0_A_SHDW_FULL : RO ;bitpos:[8] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  PWM generator 0 time stamp
 A's shadow reg is filled and waiting to be transferred to A's active reg. If cleared  A's active reg has been updated with shadow reg latest value*/
#define MCPWM_GEN0_A_SHDW_FULL  (BIT(8))
#define MCPWM_GEN0_A_SHDW_FULL_M  (BIT(8))
#define MCPWM_GEN0_A_SHDW_FULL_V  0x1
#define MCPWM_GEN0_A_SHDW_FULL_S  8
/* MCPWM_GEN0_B_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: Update method for PWM generator 0 time stamp B's active reg.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_GEN0_B_UPMETHOD  0x0000000F
#define MCPWM_GEN0_B_UPMETHOD_M  ((MCPWM_GEN0_B_UPMETHOD_V)<<(MCPWM_GEN0_B_UPMETHOD_S))
#define MCPWM_GEN0_B_UPMETHOD_V  0xF
#define MCPWM_GEN0_B_UPMETHOD_S  4
/* MCPWM_GEN0_A_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for PWM generator 0 time stamp A's active reg.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_GEN0_A_UPMETHOD  0x0000000F
#define MCPWM_GEN0_A_UPMETHOD_M  ((MCPWM_GEN0_A_UPMETHOD_V)<<(MCPWM_GEN0_A_UPMETHOD_S))
#define MCPWM_GEN0_A_UPMETHOD_V  0xF
#define MCPWM_GEN0_A_UPMETHOD_S  0

