espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_GEN0_TSTMP_A_REG(i)          (REG_MCPWM_BASE(i) + 0x0040)
/* MCPWM_GEN0_A : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: PWM generator 0 time stamp A's shadow reg*/
#define MCPWM_GEN0_A  0x0000FFFF
#define MCPWM_GEN0_A_M  ((MCPWM_GEN0_A_V)<<(MCPWM_GEN0_A_S))
#define MCPWM_GEN0_A_V  0xFFFF
#define MCPWM_GEN0_A_S  0

#define MCPWM_GEN0_TSTMP_B_REG(i)          (REG_MCPWM_BASE(i) + 0x0044)
/* MCPWM_GEN0_B : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: PWM generator 0 time stamp B's shadow reg*/
#define MCPWM_GEN0_B  0x0000FFFF
#define MCPWM_GEN0_B_M  ((MCPWM_GEN0_B_V)<<(MCPWM_GEN0_B_S))
#define MCPWM_GEN0_B_V  0xFFFF
#define MCPWM_GEN0_B_S  0

#define MCPWM_GEN0_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x0048)
/* MCPWM_GEN0_T1_SEL : R/W ;bitpos:[9:7] ;default: 3'd0 ; */
/*description: Source selection for PWM generator 0 event_t1  take effect immediately
  0: fault_event0  1: fault_event1  2: fault_event2  3: sync_taken  4: none*/
#define MCPWM_GEN0_T1_SEL  0x00000007
#define MCPWM_GEN0_T1_SEL_M  ((MCPWM_GEN0_T1_SEL_V)<<(MCPWM_GEN0_T1_SEL_S))
#define MCPWM_GEN0_T1_SEL_V  0x7
#define MCPWM_GEN0_T1_SEL_S  7
/* MCPWM_GEN0_T0_SEL : R/W ;bitpos:[6:4] ;default: 3'd0 ; */
/*description: Source selection for PWM generator 0 event_t0  take effect immediately
  0: fault_event0  1: fault_event1  2: fault_event2  3: sync_taken  4: none*/
#define MCPWM_GEN0_T0_SEL  0x00000007
#define MCPWM_GEN0_T0_SEL_M  ((MCPWM_GEN0_T0_SEL_V)<<(MCPWM_GEN0_T0_SEL_S))
#define MCPWM_GEN0_T0_SEL_V  0x7
#define MCPWM_GEN0_T0_SEL_S  4
/* MCPWM_GEN0_CFG_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for PWM generator 0's active reg of configuration.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync. bit3: disable update*/
#define MCPWM_GEN0_CFG_UPMETHOD  0x0000000F
#define MCPWM_GEN0_CFG_UPMETHOD_M  ((MCPWM_GEN0_CFG_UPMETHOD_V)<<(MCPWM_GEN0_CFG_UPMETHOD_S))
#define MCPWM_GEN0_CFG_UPMETHOD_V  0xF
#define MCPWM_GEN0_CFG_UPMETHOD_S  0

#define MCPWM_GEN0_FORCE_REG(i)          (REG_MCPWM_BASE(i) + 0x004c)
/* MCPWM_GEN0_B_NCIFORCE_MODE : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Non-continuous immediate software force mode for PWM0B  0: disabled
  1: low  2: high  3: disabled*/
#define MCPWM_GEN0_B_NCIFORCE_MODE  0x00000003
#define MCPWM_GEN0_B_NCIFORCE_MODE_M  ((MCPWM_GEN0_B_NCIFORCE_MODE_V)<<(MCPWM_GEN0_B_NCIFORCE_MODE_S))
#define MCPWM_GEN0_B_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN0_B_NCIFORCE_MODE_S  14
/* MCPWM_GEN0_B_NCIFORCE : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: Non-continuous immediate software force trigger for PWM0B  a
 toggle will trigger a force event*/
#define MCPWM_GEN0_B_NCIFORCE  (BIT(13))
#define MCPWM_GEN0_B_NCIFORCE_M  (BIT(13))
#define MCPWM_GEN0_B_NCIFORCE_V  0x1
#define MCPWM_GEN0_B_NCIFORCE_S  13
/* MCPWM_GEN0_A_NCIFORCE_MODE : R/W ;bitpos:[12:11] ;default: 2'd0 ; */
/*description: Non-continuous immediate software force mode for PWM0A  0: disabled
  1: low  2: high  3: disabled*/
#define MCPWM_GEN0_A_NCIFORCE_MODE  0x00000003
#define MCPWM_GEN0_A_NCIFORCE_MODE_M  ((MCPWM_GEN0_A_NCIFORCE_MODE_V)<<(MCPWM_GEN0_A_NCIFORCE_MODE_S))
#define MCPWM_GEN0_A_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN0_A_NCIFORCE_MODE_S  11
/* MCPWM_GEN0_A_NCIFORCE : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: Non-continuous immediate software force trigger for PWM0A  a
 toggle will trigger a force event*/
#define MCPWM_GEN0_A_NCIFORCE  (BIT(10))
#define MCPWM_GEN0_A_NCIFORCE_M  (BIT(10))
#define MCPWM_GEN0_A_NCIFORCE_V  0x1
#define MCPWM_GEN0_A_NCIFORCE_S  10
/* MCPWM_GEN0_B_CNTUFORCE_MODE : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Continuous software force mode for PWM0B. 0: disabled  1: low
  2: high  3: disabled*/
#define MCPWM_GEN0_B_CNTUFORCE_MODE  0x00000003
#define MCPWM_GEN0_B_CNTUFORCE_MODE_M  ((MCPWM_GEN0_B_CNTUFORCE_MODE_V)<<(MCPWM_GEN0_B_CNTUFORCE_MODE_S))
#define MCPWM_GEN0_B_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN0_B_CNTUFORCE_MODE_S  8
/* MCPWM_GEN0_A_CNTUFORCE_MODE : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Continuous software force mode for PWM0A. 0: disabled  1: low
  2: high  3: disabled*/
#define MCPWM_GEN0_A_CNTUFORCE_MODE  0x00000003
#define MCPWM_GEN0_A_CNTUFORCE_MODE_M  ((MCPWM_GEN0_A_CNTUFORCE_MODE_V)<<(MCPWM_GEN0_A_CNTUFORCE_MODE_S))
#define MCPWM_GEN0_A_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN0_A_CNTUFORCE_MODE_S  6
/* MCPWM_GEN0_CNTUFORCE_UPMETHOD : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: Update method for continuous software force of PWM generator0.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: TEA  bit3: TEB  bit4: sync  bit5: disable update. (TEA/B here and below means an event generated when timer value equals A/B register)*/
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD  0x0000003F
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD_M  ((MCPWM_GEN0_CNTUFORCE_UPMETHOD_V)<<(MCPWM_GEN0_CNTUFORCE_UPMETHOD_S))
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD_V  0x3F
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD_S  0

#define MCPWM_GEN0_A_REG(i)          (REG_MCPWM_BASE(i) + 0x0050)
/* MCPWM_GEN0_A_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event_t1 when timer decreasing.
 0: no change  1: low  2: high  3: toggle*/
#define MCPWM_GEN0_A_DT1  0x00000003
#define MCPWM_GEN0_A_DT1_M  ((MCPWM_GEN0_A_DT1_V)<<(MCPWM_GEN0_A_DT1_S))
#define MCPWM_GEN0_A_DT1_V  0x3
#define MCPWM_GEN0_A_DT1_S  22
/* MCPWM_GEN0_A_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event_t0 when timer decreasing*/
#define MCPWM_GEN0_A_DT0  0x00000003
#define MCPWM_GEN0_A_DT0_M  ((MCPWM_GEN0_A_DT0_V)<<(MCPWM_GEN0_A_DT0_S))
#define MCPWM_GEN0_A_DT0_V  0x3
#define MCPWM_GEN0_A_DT0_S  20
/* MCPWM_GEN0_A_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEB when timer decreasing*/
#define MCPWM_GEN0_A_DTEB  0x00000003
#define MCPWM_GEN0_A_DTEB_M  ((MCPWM_GEN0_A_DTEB_V)<<(MCPWM_GEN0_A_DTEB_S))
#define MCPWM_GEN0_A_DTEB_V  0x3
#define MCPWM_GEN0_A_DTEB_S  18
/* MCPWM_GEN0_A_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEA when timer decreasing*/
#define MCPWM_GEN0_A_DTEA  0x00000003
#define MCPWM_GEN0_A_DTEA_M  ((MCPWM_GEN0_A_DTEA_V)<<(MCPWM_GEN0_A_DTEA_S))
#define MCPWM_GEN0_A_DTEA_V  0x3
#define MCPWM_GEN0_A_DTEA_S  16
/* MCPWM_GEN0_A_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEP when timer decreasing*/
#define MCPWM_GEN0_A_DTEP  0x00000003
#define MCPWM_GEN0_A_DTEP_M  ((MCPWM_GEN0_A_DTEP_V)<<(MCPWM_GEN0_A_DTEP_S))
#define MCPWM_GEN0_A_DTEP_V  0x3
#define MCPWM_GEN0_A_DTEP_S  14
/* MCPWM_GEN0_A_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEZ when timer decreasing*/
#define MCPWM_GEN0_A_DTEZ  0x00000003
#define MCPWM_GEN0_A_DTEZ_M  ((MCPWM_GEN0_A_DTEZ_V)<<(MCPWM_GEN0_A_DTEZ_S))
#define MCPWM_GEN0_A_DTEZ_V  0x3
#define MCPWM_GEN0_A_DTEZ_S  12
/* MCPWM_GEN0_A_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event_t1 when timer increasing*/
#define MCPWM_GEN0_A_UT1  0x00000003
#define MCPWM_GEN0_A_UT1_M  ((MCPWM_GEN0_A_UT1_V)<<(MCPWM_GEN0_A_UT1_S))
#define MCPWM_GEN0_A_UT1_V  0x3
#define MCPWM_GEN0_A_UT1_S  10
/* MCPWM_GEN0_A_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event_t0 when timer increasing*/
#define MCPWM_GEN0_A_UT0  0x00000003
#define MCPWM_GEN0_A_UT0_M  ((MCPWM_GEN0_A_UT0_V)<<(MCPWM_GEN0_A_UT0_S))
#define MCPWM_GEN0_A_UT0_V  0x3
#define MCPWM_GEN0_A_UT0_S  8
/* MCPWM_GEN0_A_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEB when timer increasing*/
#define MCPWM_GEN0_A_UTEB  0x00000003
#define MCPWM_GEN0_A_UTEB_M  ((MCPWM_GEN0_A_UTEB_V)<<(MCPWM_GEN0_A_UTEB_S))
#define MCPWM_GEN0_A_UTEB_V  0x3
#define MCPWM_GEN0_A_UTEB_S  6
/* MCPWM_GEN0_A_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEA when timer increasing*/
#define MCPWM_GEN0_A_UTEA  0x00000003
#define MCPWM_GEN0_A_UTEA_M  ((MCPWM_GEN0_A_UTEA_V)<<(MCPWM_GEN0_A_UTEA_S))
#define MCPWM_GEN0_A_UTEA_V  0x3
#define MCPWM_GEN0_A_UTEA_S  4
/* MCPWM_GEN0_A_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEP when timer increasing*/
#define MCPWM_GEN0_A_UTEP  0x00000003
#define MCPWM_GEN0_A_UTEP_M  ((MCPWM_GEN0_A_UTEP_V)<<(MCPWM_GEN0_A_UTEP_S))
#define MCPWM_GEN0_A_UTEP_V  0x3
#define MCPWM_GEN0_A_UTEP_S  2
/* MCPWM_GEN0_A_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: Action on PWM0A triggered by event TEZ when timer increasing*/
#define MCPWM_GEN0_A_UTEZ  0x00000003
#define MCPWM_GEN0_A_UTEZ_M  ((MCPWM_GEN0_A_UTEZ_V)<<(MCPWM_GEN0_A_UTEZ_S))
#define MCPWM_GEN0_A_UTEZ_V  0x3
#define MCPWM_GEN0_A_UTEZ_S  0

#define MCPWM_GEN0_B_REG(i)          (REG_MCPWM_BASE(i) + 0x0054)
/* MCPWM_GEN0_B_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event_t1 when timer decreasing.
 0: no change  1: low  2: high  3: toggle*/
#define MCPWM_GEN0_B_DT1  0x00000003
#define MCPWM_GEN0_B_DT1_M  ((MCPWM_GEN0_B_DT1_V)<<(MCPWM_GEN0_B_DT1_S))
#define MCPWM_GEN0_B_DT1_V  0x3
#define MCPWM_GEN0_B_DT1_S  22
/* MCPWM_GEN0_B_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event_t0 when timer decreasing*/
#define MCPWM_GEN0_B_DT0  0x00000003
#define MCPWM_GEN0_B_DT0_M  ((MCPWM_GEN0_B_DT0_V)<<(MCPWM_GEN0_B_DT0_S))
#define MCPWM_GEN0_B_DT0_V  0x3
#define MCPWM_GEN0_B_DT0_S  20
/* MCPWM_GEN0_B_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEB when timer decreasing*/
#define MCPWM_GEN0_B_DTEB  0x00000003
#define MCPWM_GEN0_B_DTEB_M  ((MCPWM_GEN0_B_DTEB_V)<<(MCPWM_GEN0_B_DTEB_S))
#define MCPWM_GEN0_B_DTEB_V  0x3
#define MCPWM_GEN0_B_DTEB_S  18
/* MCPWM_GEN0_B_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEA when timer decreasing*/
#define MCPWM_GEN0_B_DTEA  0x00000003
#define MCPWM_GEN0_B_DTEA_M  ((MCPWM_GEN0_B_DTEA_V)<<(MCPWM_GEN0_B_DTEA_S))
#define MCPWM_GEN0_B_DTEA_V  0x3
#define MCPWM_GEN0_B_DTEA_S  16
/* MCPWM_GEN0_B_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEP when timer decreasing*/
#define MCPWM_GEN0_B_DTEP  0x00000003
#define MCPWM_GEN0_B_DTEP_M  ((MCPWM_GEN0_B_DTEP_V)<<(MCPWM_GEN0_B_DTEP_S))
#define MCPWM_GEN0_B_DTEP_V  0x3
#define MCPWM_GEN0_B_DTEP_S  14
/* MCPWM_GEN0_B_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEZ when timer decreasing*/
#define MCPWM_GEN0_B_DTEZ  0x00000003
#define MCPWM_GEN0_B_DTEZ_M  ((MCPWM_GEN0_B_DTEZ_V)<<(MCPWM_GEN0_B_DTEZ_S))
#define MCPWM_GEN0_B_DTEZ_V  0x3
#define MCPWM_GEN0_B_DTEZ_S  12
/* MCPWM_GEN0_B_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event_t1 when timer increasing*/
#define MCPWM_GEN0_B_UT1  0x00000003
#define MCPWM_GEN0_B_UT1_M  ((MCPWM_GEN0_B_UT1_V)<<(MCPWM_GEN0_B_UT1_S))
#define MCPWM_GEN0_B_UT1_V  0x3
#define MCPWM_GEN0_B_UT1_S  10
/* MCPWM_GEN0_B_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event_t0 when timer increasing*/
#define MCPWM_GEN0_B_UT0  0x00000003
#define MCPWM_GEN0_B_UT0_M  ((MCPWM_GEN0_B_UT0_V)<<(MCPWM_GEN0_B_UT0_S))
#define MCPWM_GEN0_B_UT0_V  0x3
#define MCPWM_GEN0_B_UT0_S  8
/* MCPWM_GEN0_B_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEB when timer increasing*/
#define MCPWM_GEN0_B_UTEB  0x00000003
#define MCPWM_GEN0_B_UTEB_M  ((MCPWM_GEN0_B_UTEB_V)<<(MCPWM_GEN0_B_UTEB_S))
#define MCPWM_GEN0_B_UTEB_V  0x3
#define MCPWM_GEN0_B_UTEB_S  6
/* MCPWM_GEN0_B_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEA when timer increasing*/
#define MCPWM_GEN0_B_UTEA  0x00000003
#define MCPWM_GEN0_B_UTEA_M  ((MCPWM_GEN0_B_UTEA_V)<<(MCPWM_GEN0_B_UTEA_S))
#define MCPWM_GEN0_B_UTEA_V  0x3
#define MCPWM_GEN0_B_UTEA_S  4
/* MCPWM_GEN0_B_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEP when timer increasing*/
#define MCPWM_GEN0_B_UTEP  0x00000003
#define MCPWM_GEN0_B_UTEP_M  ((MCPWM_GEN0_B_UTEP_V)<<(MCPWM_GEN0_B_UTEP_S))
#define MCPWM_GEN0_B_UTEP_V  0x3
#define MCPWM_GEN0_B_UTEP_S  2
/* MCPWM_GEN0_B_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: Action on PWM0B triggered by event TEZ when timer increasing*/
#define MCPWM_GEN0_B_UTEZ  0x00000003
#define MCPWM_GEN0_B_UTEZ_M  ((MCPWM_GEN0_B_UTEZ_V)<<(MCPWM_GEN0_B_UTEZ_S))
#define MCPWM_GEN0_B_UTEZ_V  0x3
#define MCPWM_GEN0_B_UTEZ_S  0

