espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_DT0_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0058)
/* MCPWM_DT0_CLK_SEL : R/W ;bitpos:[17] ;default: 1'd0 ; */
/*description: Dead time generator 0 clock selection. 0: PWM_clk  1: PT_clk*/
#define MCPWM_DT0_CLK_SEL  (BIT(17))
#define MCPWM_DT0_CLK_SEL_M  (BIT(17))
#define MCPWM_DT0_CLK_SEL_V  0x1
#define MCPWM_DT0_CLK_SEL_S  17
/* MCPWM_DT0_B_OUTBYPASS : R/W ;bitpos:[16] ;default: 1'd1 ; */
/*description: S0 in documentation*/
#define MCPWM_DT0_B_OUTBYPASS  (BIT(16))
#define MCPWM_DT0_B_OUTBYPASS_M  (BIT(16))
#define MCPWM_DT0_B_OUTBYPASS_V  0x1
#define MCPWM_DT0_B_OUTBYPASS_S  16
/* MCPWM_DT0_A_OUTBYPASS : R/W ;bitpos:[15] ;default: 1'd1 ; */
/*description: S1 in documentation*/
#define MCPWM_DT0_A_OUTBYPASS  (BIT(15))
#define MCPWM_DT0_A_OUTBYPASS_M  (BIT(15))
#define MCPWM_DT0_A_OUTBYPASS_V  0x1
#define MCPWM_DT0_A_OUTBYPASS_S  15
/* MCPWM_DT0_FED_OUTINVERT : R/W ;bitpos:[14] ;default: 1'd0 ; */
/*description: S3 in documentation*/
#define MCPWM_DT0_FED_OUTINVERT  (BIT(14))
#define MCPWM_DT0_FED_OUTINVERT_M  (BIT(14))
#define MCPWM_DT0_FED_OUTINVERT_V  0x1
#define MCPWM_DT0_FED_OUTINVERT_S  14
/* MCPWM_DT0_RED_OUTINVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: S2 in documentation*/
#define MCPWM_DT0_RED_OUTINVERT  (BIT(13))
#define MCPWM_DT0_RED_OUTINVERT_M  (BIT(13))
#define MCPWM_DT0_RED_OUTINVERT_V  0x1
#define MCPWM_DT0_RED_OUTINVERT_S  13
/* MCPWM_DT0_FED_INSEL : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: S5 in documentation*/
#define MCPWM_DT0_FED_INSEL  (BIT(12))
#define MCPWM_DT0_FED_INSEL_M  (BIT(12))
#define MCPWM_DT0_FED_INSEL_V  0x1
#define MCPWM_DT0_FED_INSEL_S  12
/* MCPWM_DT0_RED_INSEL : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: S4 in documentation*/
#define MCPWM_DT0_RED_INSEL  (BIT(11))
#define MCPWM_DT0_RED_INSEL_M  (BIT(11))
#define MCPWM_DT0_RED_INSEL_V  0x1
#define MCPWM_DT0_RED_INSEL_S  11
/* MCPWM_DT0_B_OUTSWAP : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: S7 in documentation*/
#define MCPWM_DT0_B_OUTSWAP  (BIT(10))
#define MCPWM_DT0_B_OUTSWAP_M  (BIT(10))
#define MCPWM_DT0_B_OUTSWAP_V  0x1
#define MCPWM_DT0_B_OUTSWAP_S  10
/* MCPWM_DT0_A_OUTSWAP : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: S6 in documentation*/
#define MCPWM_DT0_A_OUTSWAP  (BIT(9))
#define MCPWM_DT0_A_OUTSWAP_M  (BIT(9))
#define MCPWM_DT0_A_OUTSWAP_V  0x1
#define MCPWM_DT0_A_OUTSWAP_S  9
/* MCPWM_DT0_DEB_MODE : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: S8 in documentation  dual-edge B mode  0: FED/RED take effect
 on different path separately  1: FED/RED take effect on B path  A out is in bypass or normal operation mode*/
#define MCPWM_DT0_DEB_MODE  (BIT(8))
#define MCPWM_DT0_DEB_MODE_M  (BIT(8))
#define MCPWM_DT0_DEB_MODE_V  0x1
#define MCPWM_DT0_DEB_MODE_S  8
/* MCPWM_DT0_RED_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: Update method for RED (rising edge delay) active reg. 0: immediate
  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_DT0_RED_UPMETHOD  0x0000000F
#define MCPWM_DT0_RED_UPMETHOD_M  ((MCPWM_DT0_RED_UPMETHOD_V)<<(MCPWM_DT0_RED_UPMETHOD_S))
#define MCPWM_DT0_RED_UPMETHOD_V  0xF
#define MCPWM_DT0_RED_UPMETHOD_S  4
/* MCPWM_DT0_FED_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for FED (falling edge delay) active reg. 0: immediate
  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_DT0_FED_UPMETHOD  0x0000000F
#define MCPWM_DT0_FED_UPMETHOD_M  ((MCPWM_DT0_FED_UPMETHOD_V)<<(MCPWM_DT0_FED_UPMETHOD_S))
#define MCPWM_DT0_FED_UPMETHOD_V  0xF
#define MCPWM_DT0_FED_UPMETHOD_S  0

#define MCPWM_DT0_FED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x005c)
/* MCPWM_DT0_FED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Shadow reg for FED*/
#define MCPWM_DT0_FED  0x0000FFFF
#define MCPWM_DT0_FED_M  ((MCPWM_DT0_FED_V)<<(MCPWM_DT0_FED_S))
#define MCPWM_DT0_FED_V  0xFFFF
#define MCPWM_DT0_FED_S  0

#define MCPWM_DT0_RED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0060)
/* MCPWM_DT0_RED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Shadow reg for RED*/
#define MCPWM_DT0_RED  0x0000FFFF
#define MCPWM_DT0_RED_M  ((MCPWM_DT0_RED_V)<<(MCPWM_DT0_RED_S))
#define MCPWM_DT0_RED_V  0xFFFF
#define MCPWM_DT0_RED_S  0

#define MCPWM_CARRIER0_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0064)
/* MCPWM_CARRIER0_IN_INVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: When set  invert the input of PWM0A and PWM0B for this submodule*/
#define MCPWM_CARRIER0_IN_INVERT  (BIT(13))
#define MCPWM_CARRIER0_IN_INVERT_M  (BIT(13))
#define MCPWM_CARRIER0_IN_INVERT_V  0x1
#define MCPWM_CARRIER0_IN_INVERT_S  13
/* MCPWM_CARRIER0_OUT_INVERT : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: When set  invert the output of PWM0A and PWM0B for this submodule*/
#define MCPWM_CARRIER0_OUT_INVERT  (BIT(12))
#define MCPWM_CARRIER0_OUT_INVERT_M  (BIT(12))
#define MCPWM_CARRIER0_OUT_INVERT_V  0x1
#define MCPWM_CARRIER0_OUT_INVERT_S  12
/* MCPWM_CARRIER0_OSHWTH : R/W ;bitpos:[11:8] ;default: 4'd0 ; */
/*description: Width of the fist pulse in number of periods of the carrier*/
#define MCPWM_CARRIER0_OSHWTH  0x0000000F
#define MCPWM_CARRIER0_OSHWTH_M  ((MCPWM_CARRIER0_OSHWTH_V)<<(MCPWM_CARRIER0_OSHWTH_S))
#define MCPWM_CARRIER0_OSHWTH_V  0xF
#define MCPWM_CARRIER0_OSHWTH_S  8
/* MCPWM_CARRIER0_DUTY : R/W ;bitpos:[7:5] ;default: 3'd0 ; */
/*description: Carrier duty selection. Duty = PWM_CARRIER0_DUTY / 8*/
#define MCPWM_CARRIER0_DUTY  0x00000007
#define MCPWM_CARRIER0_DUTY_M  ((MCPWM_CARRIER0_DUTY_V)<<(MCPWM_CARRIER0_DUTY_S))
#define MCPWM_CARRIER0_DUTY_V  0x7
#define MCPWM_CARRIER0_DUTY_S  5
/* MCPWM_CARRIER0_PRESCALE : R/W ;bitpos:[4:1] ;default: 4'd0 ; */
/*description: PWM carrier0 clock (PC_clk) prescale value. Period of PC_clk
 = period of PWM_clk * (PWM_CARRIER0_PRESCALE + 1)*/
#define MCPWM_CARRIER0_PRESCALE  0x0000000F
#define MCPWM_CARRIER0_PRESCALE_M  ((MCPWM_CARRIER0_PRESCALE_V)<<(MCPWM_CARRIER0_PRESCALE_S))
#define MCPWM_CARRIER0_PRESCALE_V  0xF
#define MCPWM_CARRIER0_PRESCALE_S  1
/* MCPWM_CARRIER0_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: When set  carrier0 function is enabled. When cleared  carrier0 is bypassed*/
#define MCPWM_CARRIER0_EN  (BIT(0))
#define MCPWM_CARRIER0_EN_M  (BIT(0))
#define MCPWM_CARRIER0_EN_V  0x1
#define MCPWM_CARRIER0_EN_S  0

#define MCPWM_FH0_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x0068)
/* MCPWM_FH0_B_OST_U : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM0B when fault event occurs and timer
 is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_B_OST_U  0x00000003
#define MCPWM_FH0_B_OST_U_M  ((MCPWM_FH0_B_OST_U_V)<<(MCPWM_FH0_B_OST_U_S))
#define MCPWM_FH0_B_OST_U_V  0x3
#define MCPWM_FH0_B_OST_U_S  22
/* MCPWM_FH0_B_OST_D : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM0B when fault event occurs and timer
 is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_B_OST_D  0x00000003
#define MCPWM_FH0_B_OST_D_M  ((MCPWM_FH0_B_OST_D_V)<<(MCPWM_FH0_B_OST_D_S))
#define MCPWM_FH0_B_OST_D_V  0x3
#define MCPWM_FH0_B_OST_D_S  20
/* MCPWM_FH0_B_CBC_U : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM0B when fault event occurs and
 timer is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_B_CBC_U  0x00000003
#define MCPWM_FH0_B_CBC_U_M  ((MCPWM_FH0_B_CBC_U_V)<<(MCPWM_FH0_B_CBC_U_S))
#define MCPWM_FH0_B_CBC_U_V  0x3
#define MCPWM_FH0_B_CBC_U_S  18
/* MCPWM_FH0_B_CBC_D : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM0B when fault event occurs and
 timer is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_B_CBC_D  0x00000003
#define MCPWM_FH0_B_CBC_D_M  ((MCPWM_FH0_B_CBC_D_V)<<(MCPWM_FH0_B_CBC_D_S))
#define MCPWM_FH0_B_CBC_D_V  0x3
#define MCPWM_FH0_B_CBC_D_S  16
/* MCPWM_FH0_A_OST_U : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM0A when fault event occurs and timer
 is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_A_OST_U  0x00000003
#define MCPWM_FH0_A_OST_U_M  ((MCPWM_FH0_A_OST_U_V)<<(MCPWM_FH0_A_OST_U_S))
#define MCPWM_FH0_A_OST_U_V  0x3
#define MCPWM_FH0_A_OST_U_S  14
/* MCPWM_FH0_A_OST_D : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM0A when fault event occurs and timer
 is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_A_OST_D  0x00000003
#define MCPWM_FH0_A_OST_D_M  ((MCPWM_FH0_A_OST_D_V)<<(MCPWM_FH0_A_OST_D_S))
#define MCPWM_FH0_A_OST_D_V  0x3
#define MCPWM_FH0_A_OST_D_S  12
/* MCPWM_FH0_A_CBC_U : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM0A when fault event occurs and
 timer is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_A_CBC_U  0x00000003
#define MCPWM_FH0_A_CBC_U_M  ((MCPWM_FH0_A_CBC_U_V)<<(MCPWM_FH0_A_CBC_U_S))
#define MCPWM_FH0_A_CBC_U_V  0x3
#define MCPWM_FH0_A_CBC_U_S  10
/* MCPWM_FH0_A_CBC_D : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM0A when fault event occurs and
 timer is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH0_A_CBC_D  0x00000003
#define MCPWM_FH0_A_CBC_D_M  ((MCPWM_FH0_A_CBC_D_V)<<(MCPWM_FH0_A_CBC_D_S))
#define MCPWM_FH0_A_CBC_D_V  0x3
#define MCPWM_FH0_A_CBC_D_S  8
/* MCPWM_FH0_F0_OST : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: event_f0 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH0_F0_OST  (BIT(7))
#define MCPWM_FH0_F0_OST_M  (BIT(7))
#define MCPWM_FH0_F0_OST_V  0x1
#define MCPWM_FH0_F0_OST_S  7
/* MCPWM_FH0_F1_OST : R/W ;bitpos:[6] ;default: 1'd0 ; */
/*description: event_f1 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH0_F1_OST  (BIT(6))
#define MCPWM_FH0_F1_OST_M  (BIT(6))
#define MCPWM_FH0_F1_OST_V  0x1
#define MCPWM_FH0_F1_OST_S  6
/* MCPWM_FH0_F2_OST : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: event_f2 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH0_F2_OST  (BIT(5))
#define MCPWM_FH0_F2_OST_M  (BIT(5))
#define MCPWM_FH0_F2_OST_V  0x1
#define MCPWM_FH0_F2_OST_S  5
/* MCPWM_FH0_SW_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: Enable register for software force one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH0_SW_OST  (BIT(4))
#define MCPWM_FH0_SW_OST_M  (BIT(4))
#define MCPWM_FH0_SW_OST_V  0x1
#define MCPWM_FH0_SW_OST_S  4
/* MCPWM_FH0_F0_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: event_f0 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH0_F0_CBC  (BIT(3))
#define MCPWM_FH0_F0_CBC_M  (BIT(3))
#define MCPWM_FH0_F0_CBC_V  0x1
#define MCPWM_FH0_F0_CBC_S  3
/* MCPWM_FH0_F1_CBC : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: event_f1 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH0_F1_CBC  (BIT(2))
#define MCPWM_FH0_F1_CBC_M  (BIT(2))
#define MCPWM_FH0_F1_CBC_V  0x1
#define MCPWM_FH0_F1_CBC_S  2
/* MCPWM_FH0_F2_CBC : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: event_f2 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH0_F2_CBC  (BIT(1))
#define MCPWM_FH0_F2_CBC_M  (BIT(1))
#define MCPWM_FH0_F2_CBC_V  0x1
#define MCPWM_FH0_F2_CBC_S  1
/* MCPWM_FH0_SW_CBC : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: Enable register for software force cycle-by-cycle mode action.
 0: disable  1: enable*/
#define MCPWM_FH0_SW_CBC  (BIT(0))
#define MCPWM_FH0_SW_CBC_M  (BIT(0))
#define MCPWM_FH0_SW_CBC_V  0x1
#define MCPWM_FH0_SW_CBC_S  0

#define MCPWM_FH0_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x006c)
/* MCPWM_FH0_FORCE_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) triggers a
 one-shot mode action*/
#define MCPWM_FH0_FORCE_OST  (BIT(4))
#define MCPWM_FH0_FORCE_OST_M  (BIT(4))
#define MCPWM_FH0_FORCE_OST_V  0x1
#define MCPWM_FH0_FORCE_OST_S  4
/* MCPWM_FH0_FORCE_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: A toggle triggers a cycle-by-cycle mode action*/
#define MCPWM_FH0_FORCE_CBC  (BIT(3))
#define MCPWM_FH0_FORCE_CBC_M  (BIT(3))
#define MCPWM_FH0_FORCE_CBC_V  0x1
#define MCPWM_FH0_FORCE_CBC_S  3
/* MCPWM_FH0_CBCPULSE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: The cycle-by-cycle mode action refresh moment selection. Bit0: TEZ  bit1:TEP*/
#define MCPWM_FH0_CBCPULSE  0x00000003
#define MCPWM_FH0_CBCPULSE_M  ((MCPWM_FH0_CBCPULSE_V)<<(MCPWM_FH0_CBCPULSE_S))
#define MCPWM_FH0_CBCPULSE_V  0x3
#define MCPWM_FH0_CBCPULSE_S  1
/* MCPWM_FH0_CLR_OST : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: A toggle will clear on going one-shot mode action*/
#define MCPWM_FH0_CLR_OST  (BIT(0))
#define MCPWM_FH0_CLR_OST_M  (BIT(0))
#define MCPWM_FH0_CLR_OST_V  0x1
#define MCPWM_FH0_CLR_OST_S  0

#define MCPWM_FH0_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x0070)
/* MCPWM_FH0_OST_ON : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  an one-shot mode action is on going*/
#define MCPWM_FH0_OST_ON  (BIT(1))
#define MCPWM_FH0_OST_ON_M  (BIT(1))
#define MCPWM_FH0_OST_ON_V  0x1
#define MCPWM_FH0_OST_ON_S  1
/* MCPWM_FH0_CBC_ON : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  an cycle-by-cycle mode action is on going*/
#define MCPWM_FH0_CBC_ON  (BIT(0))
#define MCPWM_FH0_CBC_ON_M  (BIT(0))
#define MCPWM_FH0_CBC_ON_V  0x1
#define MCPWM_FH0_CBC_ON_S  0

#define MCPWM_GEN1_STMP_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0074)
/* MCPWM_GEN1_B_SHDW_FULL : RO ;bitpos:[9] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  PWM generator 1 time stamp
 B's shadow reg is filled and waiting to be transferred to B's active reg. If cleared  B's active reg has been updated with shadow reg latest value*/
#define MCPWM_GEN1_B_SHDW_FULL  (BIT(9))
#define MCPWM_GEN1_B_SHDW_FULL_M  (BIT(9))
#define MCPWM_GEN1_B_SHDW_FULL_V  0x1
#define MCPWM_GEN1_B_SHDW_FULL_S  9
/* MCPWM_GEN1_A_SHDW_FULL : RO ;bitpos:[8] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  PWM generator 1 time stamp
 A's shadow reg is filled and waiting to be transferred to A's active reg. If cleared  A's active reg has been updated with shadow reg latest value*/
#define MCPWM_GEN1_A_SHDW_FULL  (BIT(8))
#define MCPWM_GEN1_A_SHDW_FULL_M  (BIT(8))
#define MCPWM_GEN1_A_SHDW_FULL_V  0x1
#define MCPWM_GEN1_A_SHDW_FULL_S  8
/* MCPWM_GEN1_B_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: Update method for PWM generator 1 time stamp B's active reg.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_GEN1_B_UPMETHOD  0x0000000F
#define MCPWM_GEN1_B_UPMETHOD_M  ((MCPWM_GEN1_B_UPMETHOD_V)<<(MCPWM_GEN1_B_UPMETHOD_S))
#define MCPWM_GEN1_B_UPMETHOD_V  0xF
#define MCPWM_GEN1_B_UPMETHOD_S  4
/* MCPWM_GEN1_A_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for PWM generator 1 time stamp A's active reg.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_GEN1_A_UPMETHOD  0x0000000F
#define MCPWM_GEN1_A_UPMETHOD_M  ((MCPWM_GEN1_A_UPMETHOD_V)<<(MCPWM_GEN1_A_UPMETHOD_S))
#define MCPWM_GEN1_A_UPMETHOD_V  0xF
#define MCPWM_GEN1_A_UPMETHOD_S  0

#define MCPWM_GEN1_TSTMP_A_REG(i)          (REG_MCPWM_BASE(i) + 0x0078)
/* MCPWM_GEN1_A : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: PWM generator 1 time stamp A's shadow reg*/
#define MCPWM_GEN1_A  0x0000FFFF
#define MCPWM_GEN1_A_M  ((MCPWM_GEN1_A_V)<<(MCPWM_GEN1_A_S))
#define MCPWM_GEN1_A_V  0xFFFF
#define MCPWM_GEN1_A_S  0

#define MCPWM_GEN1_TSTMP_B_REG(i)          (REG_MCPWM_BASE(i) + 0x007c)
/* MCPWM_GEN1_B : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: PWM generator 1 time stamp B's shadow reg*/
#define MCPWM_GEN1_B  0x0000FFFF
#define MCPWM_GEN1_B_M  ((MCPWM_GEN1_B_V)<<(MCPWM_GEN1_B_S))
#define MCPWM_GEN1_B_V  0xFFFF
#define MCPWM_GEN1_B_S  0

