espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_GEN1_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x0080)
/* MCPWM_GEN1_T1_SEL : R/W ;bitpos:[9:7] ;default: 3'd0 ; */
/*description: Source selection for PWM generate1 event_t1  take effect immediately
  0: fault_event0  1: fault_event1  2: fault_event2  3: sync_taken  4: none*/
#define MCPWM_GEN1_T1_SEL  0x00000007
#define MCPWM_GEN1_T1_SEL_M  ((MCPWM_GEN1_T1_SEL_V)<<(MCPWM_GEN1_T1_SEL_S))
#define MCPWM_GEN1_T1_SEL_V  0x7
#define MCPWM_GEN1_T1_SEL_S  7
/* MCPWM_GEN1_T0_SEL : R/W ;bitpos:[6:4] ;default: 3'd0 ; */
/*description: Source selection for PWM generate1 event_t0  take effect immediately
  0: fault_event0  1: fault_event1  2: fault_event2  3: sync_taken  4: none*/
#define MCPWM_GEN1_T0_SEL  0x00000007
#define MCPWM_GEN1_T0_SEL_M  ((MCPWM_GEN1_T0_SEL_V)<<(MCPWM_GEN1_T0_SEL_S))
#define MCPWM_GEN1_T0_SEL_V  0x7
#define MCPWM_GEN1_T0_SEL_S  4
/* MCPWM_GEN1_CFG_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for PWM generate1's active reg of configuration.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync. bit3: disable update*/
#define MCPWM_GEN1_CFG_UPMETHOD  0x0000000F
#define MCPWM_GEN1_CFG_UPMETHOD_M  ((MCPWM_GEN1_CFG_UPMETHOD_V)<<(MCPWM_GEN1_CFG_UPMETHOD_S))
#define MCPWM_GEN1_CFG_UPMETHOD_V  0xF
#define MCPWM_GEN1_CFG_UPMETHOD_S  0

#define MCPWM_GEN1_FORCE_REG(i)          (REG_MCPWM_BASE(i) + 0x0084)
/* MCPWM_GEN1_B_NCIFORCE_MODE : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Non-continuous immediate software force mode for PWM1B  0: disabled
  1: low  2: high  3: disabled*/
#define MCPWM_GEN1_B_NCIFORCE_MODE  0x00000003
#define MCPWM_GEN1_B_NCIFORCE_MODE_M  ((MCPWM_GEN1_B_NCIFORCE_MODE_V)<<(MCPWM_GEN1_B_NCIFORCE_MODE_S))
#define MCPWM_GEN1_B_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN1_B_NCIFORCE_MODE_S  14
/* MCPWM_GEN1_B_NCIFORCE : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: Non-continuous immediate software force trigger for PWM1B  a
 toggle will trigger a force event*/
#define MCPWM_GEN1_B_NCIFORCE  (BIT(13))
#define MCPWM_GEN1_B_NCIFORCE_M  (BIT(13))
#define MCPWM_GEN1_B_NCIFORCE_V  0x1
#define MCPWM_GEN1_B_NCIFORCE_S  13
/* MCPWM_GEN1_A_NCIFORCE_MODE : R/W ;bitpos:[12:11] ;default: 2'd0 ; */
/*description: Non-continuous immediate software force mode for PWM1A  0: disabled
  1: low  2: high  3: disabled*/
#define MCPWM_GEN1_A_NCIFORCE_MODE  0x00000003
#define MCPWM_GEN1_A_NCIFORCE_MODE_M  ((MCPWM_GEN1_A_NCIFORCE_MODE_V)<<(MCPWM_GEN1_A_NCIFORCE_MODE_S))
#define MCPWM_GEN1_A_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN1_A_NCIFORCE_MODE_S  11
/* MCPWM_GEN1_A_NCIFORCE : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: Non-continuous immediate software force trigger for PWM1A  a
 toggle will trigger a force event*/
#define MCPWM_GEN1_A_NCIFORCE  (BIT(10))
#define MCPWM_GEN1_A_NCIFORCE_M  (BIT(10))
#define MCPWM_GEN1_A_NCIFORCE_V  0x1
#define MCPWM_GEN1_A_NCIFORCE_S  10
/* MCPWM_GEN1_B_CNTUFORCE_MODE : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Continuous software force mode for PWM1B. 0: disabled  1: low
  2: high  3: disabled*/
#define MCPWM_GEN1_B_CNTUFORCE_MODE  0x00000003
#define MCPWM_GEN1_B_CNTUFORCE_MODE_M  ((MCPWM_GEN1_B_CNTUFORCE_MODE_V)<<(MCPWM_GEN1_B_CNTUFORCE_MODE_S))
#define MCPWM_GEN1_B_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN1_B_CNTUFORCE_MODE_S  8
/* MCPWM_GEN1_A_CNTUFORCE_MODE : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Continuous software force mode for PWM1A. 0: disabled  1: low
  2: high  3: disabled*/
#define MCPWM_GEN1_A_CNTUFORCE_MODE  0x00000003
#define MCPWM_GEN1_A_CNTUFORCE_MODE_M  ((MCPWM_GEN1_A_CNTUFORCE_MODE_V)<<(MCPWM_GEN1_A_CNTUFORCE_MODE_S))
#define MCPWM_GEN1_A_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN1_A_CNTUFORCE_MODE_S  6
/* MCPWM_GEN1_CNTUFORCE_UPMETHOD : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: Update method for continuous software force of PWM generator1.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: TEA  bit3: TEB  bit4: sync  bit5: disable update. (TEA/B here and below means an event generated when timer value equals A/B register)*/
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD  0x0000003F
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD_M  ((MCPWM_GEN1_CNTUFORCE_UPMETHOD_V)<<(MCPWM_GEN1_CNTUFORCE_UPMETHOD_S))
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD_V  0x3F
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD_S  0

#define MCPWM_GEN1_A_REG(i)          (REG_MCPWM_BASE(i) + 0x0088)
/* MCPWM_GEN1_A_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event_t1 when timer decreasing.
 0: no change  1: low  2: high  3: toggle*/
#define MCPWM_GEN1_A_DT1  0x00000003
#define MCPWM_GEN1_A_DT1_M  ((MCPWM_GEN1_A_DT1_V)<<(MCPWM_GEN1_A_DT1_S))
#define MCPWM_GEN1_A_DT1_V  0x3
#define MCPWM_GEN1_A_DT1_S  22
/* MCPWM_GEN1_A_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event_t0 when timer decreasing*/
#define MCPWM_GEN1_A_DT0  0x00000003
#define MCPWM_GEN1_A_DT0_M  ((MCPWM_GEN1_A_DT0_V)<<(MCPWM_GEN1_A_DT0_S))
#define MCPWM_GEN1_A_DT0_V  0x3
#define MCPWM_GEN1_A_DT0_S  20
/* MCPWM_GEN1_A_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEB when timer decreasing*/
#define MCPWM_GEN1_A_DTEB  0x00000003
#define MCPWM_GEN1_A_DTEB_M  ((MCPWM_GEN1_A_DTEB_V)<<(MCPWM_GEN1_A_DTEB_S))
#define MCPWM_GEN1_A_DTEB_V  0x3
#define MCPWM_GEN1_A_DTEB_S  18
/* MCPWM_GEN1_A_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEA when timer decreasing*/
#define MCPWM_GEN1_A_DTEA  0x00000003
#define MCPWM_GEN1_A_DTEA_M  ((MCPWM_GEN1_A_DTEA_V)<<(MCPWM_GEN1_A_DTEA_S))
#define MCPWM_GEN1_A_DTEA_V  0x3
#define MCPWM_GEN1_A_DTEA_S  16
/* MCPWM_GEN1_A_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEP when timer decreasing*/
#define MCPWM_GEN1_A_DTEP  0x00000003
#define MCPWM_GEN1_A_DTEP_M  ((MCPWM_GEN1_A_DTEP_V)<<(MCPWM_GEN1_A_DTEP_S))
#define MCPWM_GEN1_A_DTEP_V  0x3
#define MCPWM_GEN1_A_DTEP_S  14
/* MCPWM_GEN1_A_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEZ when timer decreasing*/
#define MCPWM_GEN1_A_DTEZ  0x00000003
#define MCPWM_GEN1_A_DTEZ_M  ((MCPWM_GEN1_A_DTEZ_V)<<(MCPWM_GEN1_A_DTEZ_S))
#define MCPWM_GEN1_A_DTEZ_V  0x3
#define MCPWM_GEN1_A_DTEZ_S  12
/* MCPWM_GEN1_A_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event_t1 when timer increasing*/
#define MCPWM_GEN1_A_UT1  0x00000003
#define MCPWM_GEN1_A_UT1_M  ((MCPWM_GEN1_A_UT1_V)<<(MCPWM_GEN1_A_UT1_S))
#define MCPWM_GEN1_A_UT1_V  0x3
#define MCPWM_GEN1_A_UT1_S  10
/* MCPWM_GEN1_A_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event_t0 when timer increasing*/
#define MCPWM_GEN1_A_UT0  0x00000003
#define MCPWM_GEN1_A_UT0_M  ((MCPWM_GEN1_A_UT0_V)<<(MCPWM_GEN1_A_UT0_S))
#define MCPWM_GEN1_A_UT0_V  0x3
#define MCPWM_GEN1_A_UT0_S  8
/* MCPWM_GEN1_A_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEB when timer increasing*/
#define MCPWM_GEN1_A_UTEB  0x00000003
#define MCPWM_GEN1_A_UTEB_M  ((MCPWM_GEN1_A_UTEB_V)<<(MCPWM_GEN1_A_UTEB_S))
#define MCPWM_GEN1_A_UTEB_V  0x3
#define MCPWM_GEN1_A_UTEB_S  6
/* MCPWM_GEN1_A_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEA when timer increasing*/
#define MCPWM_GEN1_A_UTEA  0x00000003
#define MCPWM_GEN1_A_UTEA_M  ((MCPWM_GEN1_A_UTEA_V)<<(MCPWM_GEN1_A_UTEA_S))
#define MCPWM_GEN1_A_UTEA_V  0x3
#define MCPWM_GEN1_A_UTEA_S  4
/* MCPWM_GEN1_A_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEP when timer increasing*/
#define MCPWM_GEN1_A_UTEP  0x00000003
#define MCPWM_GEN1_A_UTEP_M  ((MCPWM_GEN1_A_UTEP_V)<<(MCPWM_GEN1_A_UTEP_S))
#define MCPWM_GEN1_A_UTEP_V  0x3
#define MCPWM_GEN1_A_UTEP_S  2
/* MCPWM_GEN1_A_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: Action on PWM1A triggered by event TEZ when timer increasing*/
#define MCPWM_GEN1_A_UTEZ  0x00000003
#define MCPWM_GEN1_A_UTEZ_M  ((MCPWM_GEN1_A_UTEZ_V)<<(MCPWM_GEN1_A_UTEZ_S))
#define MCPWM_GEN1_A_UTEZ_V  0x3
#define MCPWM_GEN1_A_UTEZ_S  0

#define MCPWM_GEN1_B_REG(i)          (REG_MCPWM_BASE(i) + 0x008c)
/* MCPWM_GEN1_B_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event_t1 when timer decreasing.
 0: no change  1: low  2: high  3: toggle*/
#define MCPWM_GEN1_B_DT1  0x00000003
#define MCPWM_GEN1_B_DT1_M  ((MCPWM_GEN1_B_DT1_V)<<(MCPWM_GEN1_B_DT1_S))
#define MCPWM_GEN1_B_DT1_V  0x3
#define MCPWM_GEN1_B_DT1_S  22
/* MCPWM_GEN1_B_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event_t0 when timer decreasing*/
#define MCPWM_GEN1_B_DT0  0x00000003
#define MCPWM_GEN1_B_DT0_M  ((MCPWM_GEN1_B_DT0_V)<<(MCPWM_GEN1_B_DT0_S))
#define MCPWM_GEN1_B_DT0_V  0x3
#define MCPWM_GEN1_B_DT0_S  20
/* MCPWM_GEN1_B_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEB when timer decreasing*/
#define MCPWM_GEN1_B_DTEB  0x00000003
#define MCPWM_GEN1_B_DTEB_M  ((MCPWM_GEN1_B_DTEB_V)<<(MCPWM_GEN1_B_DTEB_S))
#define MCPWM_GEN1_B_DTEB_V  0x3
#define MCPWM_GEN1_B_DTEB_S  18
/* MCPWM_GEN1_B_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEA when timer decreasing*/
#define MCPWM_GEN1_B_DTEA  0x00000003
#define MCPWM_GEN1_B_DTEA_M  ((MCPWM_GEN1_B_DTEA_V)<<(MCPWM_GEN1_B_DTEA_S))
#define MCPWM_GEN1_B_DTEA_V  0x3
#define MCPWM_GEN1_B_DTEA_S  16
/* MCPWM_GEN1_B_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEP when timer decreasing*/
#define MCPWM_GEN1_B_DTEP  0x00000003
#define MCPWM_GEN1_B_DTEP_M  ((MCPWM_GEN1_B_DTEP_V)<<(MCPWM_GEN1_B_DTEP_S))
#define MCPWM_GEN1_B_DTEP_V  0x3
#define MCPWM_GEN1_B_DTEP_S  14
/* MCPWM_GEN1_B_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEZ when timer decreasing*/
#define MCPWM_GEN1_B_DTEZ  0x00000003
#define MCPWM_GEN1_B_DTEZ_M  ((MCPWM_GEN1_B_DTEZ_V)<<(MCPWM_GEN1_B_DTEZ_S))
#define MCPWM_GEN1_B_DTEZ_V  0x3
#define MCPWM_GEN1_B_DTEZ_S  12
/* MCPWM_GEN1_B_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event_t1 when timer increasing*/
#define MCPWM_GEN1_B_UT1  0x00000003
#define MCPWM_GEN1_B_UT1_M  ((MCPWM_GEN1_B_UT1_V)<<(MCPWM_GEN1_B_UT1_S))
#define MCPWM_GEN1_B_UT1_V  0x3
#define MCPWM_GEN1_B_UT1_S  10
/* MCPWM_GEN1_B_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event_t0 when timer increasing*/
#define MCPWM_GEN1_B_UT0  0x00000003
#define MCPWM_GEN1_B_UT0_M  ((MCPWM_GEN1_B_UT0_V)<<(MCPWM_GEN1_B_UT0_S))
#define MCPWM_GEN1_B_UT0_V  0x3
#define MCPWM_GEN1_B_UT0_S  8
/* MCPWM_GEN1_B_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEB when timer increasing*/
#define MCPWM_GEN1_B_UTEB  0x00000003
#define MCPWM_GEN1_B_UTEB_M  ((MCPWM_GEN1_B_UTEB_V)<<(MCPWM_GEN1_B_UTEB_S))
#define MCPWM_GEN1_B_UTEB_V  0x3
#define MCPWM_GEN1_B_UTEB_S  6
/* MCPWM_GEN1_B_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEA when timer increasing*/
#define MCPWM_GEN1_B_UTEA  0x00000003
#define MCPWM_GEN1_B_UTEA_M  ((MCPWM_GEN1_B_UTEA_V)<<(MCPWM_GEN1_B_UTEA_S))
#define MCPWM_GEN1_B_UTEA_V  0x3
#define MCPWM_GEN1_B_UTEA_S  4
/* MCPWM_GEN1_B_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEP when timer increasing*/
#define MCPWM_GEN1_B_UTEP  0x00000003
#define MCPWM_GEN1_B_UTEP_M  ((MCPWM_GEN1_B_UTEP_V)<<(MCPWM_GEN1_B_UTEP_S))
#define MCPWM_GEN1_B_UTEP_V  0x3
#define MCPWM_GEN1_B_UTEP_S  2
/* MCPWM_GEN1_B_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: Action on PWM1B triggered by event TEZ when timer increasing*/
#define MCPWM_GEN1_B_UTEZ  0x00000003
#define MCPWM_GEN1_B_UTEZ_M  ((MCPWM_GEN1_B_UTEZ_V)<<(MCPWM_GEN1_B_UTEZ_S))
#define MCPWM_GEN1_B_UTEZ_V  0x3
#define MCPWM_GEN1_B_UTEZ_S  0

#define MCPWM_DT1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0090)
/* MCPWM_DT1_CLK_SEL : R/W ;bitpos:[17] ;default: 1'd0 ; */
/*description: Dead time generator 1 clock selection. 0: PWM_clk  1: PT_clk*/
#define MCPWM_DT1_CLK_SEL  (BIT(17))
#define MCPWM_DT1_CLK_SEL_M  (BIT(17))
#define MCPWM_DT1_CLK_SEL_V  0x1
#define MCPWM_DT1_CLK_SEL_S  17
/* MCPWM_DT1_B_OUTBYPASS : R/W ;bitpos:[16] ;default: 1'd1 ; */
/*description: S0 in documentation*/
#define MCPWM_DT1_B_OUTBYPASS  (BIT(16))
#define MCPWM_DT1_B_OUTBYPASS_M  (BIT(16))
#define MCPWM_DT1_B_OUTBYPASS_V  0x1
#define MCPWM_DT1_B_OUTBYPASS_S  16
/* MCPWM_DT1_A_OUTBYPASS : R/W ;bitpos:[15] ;default: 1'd1 ; */
/*description: S1 in documentation*/
#define MCPWM_DT1_A_OUTBYPASS  (BIT(15))
#define MCPWM_DT1_A_OUTBYPASS_M  (BIT(15))
#define MCPWM_DT1_A_OUTBYPASS_V  0x1
#define MCPWM_DT1_A_OUTBYPASS_S  15
/* MCPWM_DT1_FED_OUTINVERT : R/W ;bitpos:[14] ;default: 1'd0 ; */
/*description: S3 in documentation*/
#define MCPWM_DT1_FED_OUTINVERT  (BIT(14))
#define MCPWM_DT1_FED_OUTINVERT_M  (BIT(14))
#define MCPWM_DT1_FED_OUTINVERT_V  0x1
#define MCPWM_DT1_FED_OUTINVERT_S  14
/* MCPWM_DT1_RED_OUTINVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: S2 in documentation*/
#define MCPWM_DT1_RED_OUTINVERT  (BIT(13))
#define MCPWM_DT1_RED_OUTINVERT_M  (BIT(13))
#define MCPWM_DT1_RED_OUTINVERT_V  0x1
#define MCPWM_DT1_RED_OUTINVERT_S  13
/* MCPWM_DT1_FED_INSEL : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: S5 in documentation*/
#define MCPWM_DT1_FED_INSEL  (BIT(12))
#define MCPWM_DT1_FED_INSEL_M  (BIT(12))
#define MCPWM_DT1_FED_INSEL_V  0x1
#define MCPWM_DT1_FED_INSEL_S  12
/* MCPWM_DT1_RED_INSEL : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: S4 in documentation*/
#define MCPWM_DT1_RED_INSEL  (BIT(11))
#define MCPWM_DT1_RED_INSEL_M  (BIT(11))
#define MCPWM_DT1_RED_INSEL_V  0x1
#define MCPWM_DT1_RED_INSEL_S  11
/* MCPWM_DT1_B_OUTSWAP : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: S7 in documentation*/
#define MCPWM_DT1_B_OUTSWAP  (BIT(10))
#define MCPWM_DT1_B_OUTSWAP_M  (BIT(10))
#define MCPWM_DT1_B_OUTSWAP_V  0x1
#define MCPWM_DT1_B_OUTSWAP_S  10
/* MCPWM_DT1_A_OUTSWAP : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: S6 in documentation*/
#define MCPWM_DT1_A_OUTSWAP  (BIT(9))
#define MCPWM_DT1_A_OUTSWAP_M  (BIT(9))
#define MCPWM_DT1_A_OUTSWAP_V  0x1
#define MCPWM_DT1_A_OUTSWAP_S  9
/* MCPWM_DT1_DEB_MODE : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: S8 in documentation  dual-edge B mode  0: FED/RED take effect
 on different path separately  1: FED/RED take effect on B path  A out is in bypass or normal operation mode*/
#define MCPWM_DT1_DEB_MODE  (BIT(8))
#define MCPWM_DT1_DEB_MODE_M  (BIT(8))
#define MCPWM_DT1_DEB_MODE_V  0x1
#define MCPWM_DT1_DEB_MODE_S  8
/* MCPWM_DT1_RED_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: Update method for RED (rising edge delay) active reg. 0: immediate
  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_DT1_RED_UPMETHOD  0x0000000F
#define MCPWM_DT1_RED_UPMETHOD_M  ((MCPWM_DT1_RED_UPMETHOD_V)<<(MCPWM_DT1_RED_UPMETHOD_S))
#define MCPWM_DT1_RED_UPMETHOD_V  0xF
#define MCPWM_DT1_RED_UPMETHOD_S  4
/* MCPWM_DT1_FED_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for FED (falling edge delay) active reg. 0: immediate
  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_DT1_FED_UPMETHOD  0x0000000F
#define MCPWM_DT1_FED_UPMETHOD_M  ((MCPWM_DT1_FED_UPMETHOD_V)<<(MCPWM_DT1_FED_UPMETHOD_S))
#define MCPWM_DT1_FED_UPMETHOD_V  0xF
#define MCPWM_DT1_FED_UPMETHOD_S  0

#define MCPWM_DT1_FED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0094)
/* MCPWM_DT1_FED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Shadow reg for FED*/
#define MCPWM_DT1_FED  0x0000FFFF
#define MCPWM_DT1_FED_M  ((MCPWM_DT1_FED_V)<<(MCPWM_DT1_FED_S))
#define MCPWM_DT1_FED_V  0xFFFF
#define MCPWM_DT1_FED_S  0

#define MCPWM_DT1_RED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x0098)
/* MCPWM_DT1_RED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: Shadow reg for RED*/
#define MCPWM_DT1_RED  0x0000FFFF
#define MCPWM_DT1_RED_M  ((MCPWM_DT1_RED_V)<<(MCPWM_DT1_RED_S))
#define MCPWM_DT1_RED_V  0xFFFF
#define MCPWM_DT1_RED_S  0

#define MCPWM_CARRIER1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x009c)
/* MCPWM_CARRIER1_IN_INVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: When set  invert the input of PWM1A and PWM1B for this submodule*/
#define MCPWM_CARRIER1_IN_INVERT  (BIT(13))
#define MCPWM_CARRIER1_IN_INVERT_M  (BIT(13))
#define MCPWM_CARRIER1_IN_INVERT_V  0x1
#define MCPWM_CARRIER1_IN_INVERT_S  13
/* MCPWM_CARRIER1_OUT_INVERT : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: When set  invert the output of PWM1A and PWM1B for this submodule*/
#define MCPWM_CARRIER1_OUT_INVERT  (BIT(12))
#define MCPWM_CARRIER1_OUT_INVERT_M  (BIT(12))
#define MCPWM_CARRIER1_OUT_INVERT_V  0x1
#define MCPWM_CARRIER1_OUT_INVERT_S  12
/* MCPWM_CARRIER1_OSHWTH : R/W ;bitpos:[11:8] ;default: 4'd0 ; */
/*description: Width of the fist pulse in number of periods of the carrier*/
#define MCPWM_CARRIER1_OSHWTH  0x0000000F
#define MCPWM_CARRIER1_OSHWTH_M  ((MCPWM_CARRIER1_OSHWTH_V)<<(MCPWM_CARRIER1_OSHWTH_S))
#define MCPWM_CARRIER1_OSHWTH_V  0xF
#define MCPWM_CARRIER1_OSHWTH_S  8
/* MCPWM_CARRIER1_DUTY : R/W ;bitpos:[7:5] ;default: 3'd0 ; */
/*description: Carrier duty selection. Duty = PWM_CARRIER1_DUTY / 8*/
#define MCPWM_CARRIER1_DUTY  0x00000007
#define MCPWM_CARRIER1_DUTY_M  ((MCPWM_CARRIER1_DUTY_V)<<(MCPWM_CARRIER1_DUTY_S))
#define MCPWM_CARRIER1_DUTY_V  0x7
#define MCPWM_CARRIER1_DUTY_S  5
/* MCPWM_CARRIER1_PRESCALE : R/W ;bitpos:[4:1] ;default: 4'd0 ; */
/*description: PWM carrier1 clock (PC_clk) prescale value. Period of PC_clk
 = period of PWM_clk * (PWM_CARRIER1_PRESCALE + 1)*/
#define MCPWM_CARRIER1_PRESCALE  0x0000000F
#define MCPWM_CARRIER1_PRESCALE_M  ((MCPWM_CARRIER1_PRESCALE_V)<<(MCPWM_CARRIER1_PRESCALE_S))
#define MCPWM_CARRIER1_PRESCALE_V  0xF
#define MCPWM_CARRIER1_PRESCALE_S  1
/* MCPWM_CARRIER1_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: When set  carrier1 function is enabled. When cleared  carrier1 is bypassed*/
#define MCPWM_CARRIER1_EN  (BIT(0))
#define MCPWM_CARRIER1_EN_M  (BIT(0))
#define MCPWM_CARRIER1_EN_V  0x1
#define MCPWM_CARRIER1_EN_S  0

#define MCPWM_FH1_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x00a0)
/* MCPWM_FH1_B_OST_U : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM1B when fault event occurs and timer
 is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_B_OST_U  0x00000003
#define MCPWM_FH1_B_OST_U_M  ((MCPWM_FH1_B_OST_U_V)<<(MCPWM_FH1_B_OST_U_S))
#define MCPWM_FH1_B_OST_U_V  0x3
#define MCPWM_FH1_B_OST_U_S  22
/* MCPWM_FH1_B_OST_D : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM1B when fault event occurs and timer
 is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_B_OST_D  0x00000003
#define MCPWM_FH1_B_OST_D_M  ((MCPWM_FH1_B_OST_D_V)<<(MCPWM_FH1_B_OST_D_S))
#define MCPWM_FH1_B_OST_D_V  0x3
#define MCPWM_FH1_B_OST_D_S  20
/* MCPWM_FH1_B_CBC_U : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM1B when fault event occurs and
 timer is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_B_CBC_U  0x00000003
#define MCPWM_FH1_B_CBC_U_M  ((MCPWM_FH1_B_CBC_U_V)<<(MCPWM_FH1_B_CBC_U_S))
#define MCPWM_FH1_B_CBC_U_V  0x3
#define MCPWM_FH1_B_CBC_U_S  18
/* MCPWM_FH1_B_CBC_D : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM1B when fault event occurs and
 timer is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_B_CBC_D  0x00000003
#define MCPWM_FH1_B_CBC_D_M  ((MCPWM_FH1_B_CBC_D_V)<<(MCPWM_FH1_B_CBC_D_S))
#define MCPWM_FH1_B_CBC_D_V  0x3
#define MCPWM_FH1_B_CBC_D_S  16
/* MCPWM_FH1_A_OST_U : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM1A when fault event occurs and timer
 is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_A_OST_U  0x00000003
#define MCPWM_FH1_A_OST_U_M  ((MCPWM_FH1_A_OST_U_V)<<(MCPWM_FH1_A_OST_U_S))
#define MCPWM_FH1_A_OST_U_V  0x3
#define MCPWM_FH1_A_OST_U_S  14
/* MCPWM_FH1_A_OST_D : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM1A when fault event occurs and timer
 is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_A_OST_D  0x00000003
#define MCPWM_FH1_A_OST_D_M  ((MCPWM_FH1_A_OST_D_V)<<(MCPWM_FH1_A_OST_D_S))
#define MCPWM_FH1_A_OST_D_V  0x3
#define MCPWM_FH1_A_OST_D_S  12
/* MCPWM_FH1_A_CBC_U : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM1A when fault event occurs and
 timer is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_A_CBC_U  0x00000003
#define MCPWM_FH1_A_CBC_U_M  ((MCPWM_FH1_A_CBC_U_V)<<(MCPWM_FH1_A_CBC_U_S))
#define MCPWM_FH1_A_CBC_U_V  0x3
#define MCPWM_FH1_A_CBC_U_S  10
/* MCPWM_FH1_A_CBC_D : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM1A when fault event occurs and
 timer is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH1_A_CBC_D  0x00000003
#define MCPWM_FH1_A_CBC_D_M  ((MCPWM_FH1_A_CBC_D_V)<<(MCPWM_FH1_A_CBC_D_S))
#define MCPWM_FH1_A_CBC_D_V  0x3
#define MCPWM_FH1_A_CBC_D_S  8
/* MCPWM_FH1_F0_OST : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: event_f0 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH1_F0_OST  (BIT(7))
#define MCPWM_FH1_F0_OST_M  (BIT(7))
#define MCPWM_FH1_F0_OST_V  0x1
#define MCPWM_FH1_F0_OST_S  7
/* MCPWM_FH1_F1_OST : R/W ;bitpos:[6] ;default: 1'd0 ; */
/*description: event_f1 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH1_F1_OST  (BIT(6))
#define MCPWM_FH1_F1_OST_M  (BIT(6))
#define MCPWM_FH1_F1_OST_V  0x1
#define MCPWM_FH1_F1_OST_S  6
/* MCPWM_FH1_F2_OST : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: event_f2 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH1_F2_OST  (BIT(5))
#define MCPWM_FH1_F2_OST_M  (BIT(5))
#define MCPWM_FH1_F2_OST_V  0x1
#define MCPWM_FH1_F2_OST_S  5
/* MCPWM_FH1_SW_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: Enable register for software force one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH1_SW_OST  (BIT(4))
#define MCPWM_FH1_SW_OST_M  (BIT(4))
#define MCPWM_FH1_SW_OST_V  0x1
#define MCPWM_FH1_SW_OST_S  4
/* MCPWM_FH1_F0_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: event_f0 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH1_F0_CBC  (BIT(3))
#define MCPWM_FH1_F0_CBC_M  (BIT(3))
#define MCPWM_FH1_F0_CBC_V  0x1
#define MCPWM_FH1_F0_CBC_S  3
/* MCPWM_FH1_F1_CBC : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: event_f1 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH1_F1_CBC  (BIT(2))
#define MCPWM_FH1_F1_CBC_M  (BIT(2))
#define MCPWM_FH1_F1_CBC_V  0x1
#define MCPWM_FH1_F1_CBC_S  2
/* MCPWM_FH1_F2_CBC : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: event_f2 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH1_F2_CBC  (BIT(1))
#define MCPWM_FH1_F2_CBC_M  (BIT(1))
#define MCPWM_FH1_F2_CBC_V  0x1
#define MCPWM_FH1_F2_CBC_S  1
/* MCPWM_FH1_SW_CBC : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: Enable register for software force cycle-by-cycle mode action.
 0: disable  1: enable*/
#define MCPWM_FH1_SW_CBC  (BIT(0))
#define MCPWM_FH1_SW_CBC_M  (BIT(0))
#define MCPWM_FH1_SW_CBC_V  0x1
#define MCPWM_FH1_SW_CBC_S  0

