espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_FH1_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x00a4)
/* MCPWM_FH1_FORCE_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) triggers a
 one-shot mode action*/
#define MCPWM_FH1_FORCE_OST  (BIT(4))
#define MCPWM_FH1_FORCE_OST_M  (BIT(4))
#define MCPWM_FH1_FORCE_OST_V  0x1
#define MCPWM_FH1_FORCE_OST_S  4
/* MCPWM_FH1_FORCE_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: A toggle triggers a cycle-by-cycle mode action*/
#define MCPWM_FH1_FORCE_CBC  (BIT(3))
#define MCPWM_FH1_FORCE_CBC_M  (BIT(3))
#define MCPWM_FH1_FORCE_CBC_V  0x1
#define MCPWM_FH1_FORCE_CBC_S  3
/* MCPWM_FH1_CBCPULSE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: The cycle-by-cycle mode action refresh moment selection. Bit0: TEZ  bit1:TEP*/
#define MCPWM_FH1_CBCPULSE  0x00000003
#define MCPWM_FH1_CBCPULSE_M  ((MCPWM_FH1_CBCPULSE_V)<<(MCPWM_FH1_CBCPULSE_S))
#define MCPWM_FH1_CBCPULSE_V  0x3
#define MCPWM_FH1_CBCPULSE_S  1
/* MCPWM_FH1_CLR_OST : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: A toggle will clear on going one-shot mode action*/
#define MCPWM_FH1_CLR_OST  (BIT(0))
#define MCPWM_FH1_CLR_OST_M  (BIT(0))
#define MCPWM_FH1_CLR_OST_V  0x1
#define MCPWM_FH1_CLR_OST_S  0

#define MCPWM_FH1_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x00a8)
/* MCPWM_FH1_OST_ON : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  an one-shot mode action is on going*/
#define MCPWM_FH1_OST_ON  (BIT(1))
#define MCPWM_FH1_OST_ON_M  (BIT(1))
#define MCPWM_FH1_OST_ON_V  0x1
#define MCPWM_FH1_OST_ON_S  1
/* MCPWM_FH1_CBC_ON : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  an cycle-by-cycle mode action is on going*/
#define MCPWM_FH1_CBC_ON  (BIT(0))
#define MCPWM_FH1_CBC_ON_M  (BIT(0))
#define MCPWM_FH1_CBC_ON_V  0x1
#define MCPWM_FH1_CBC_ON_S  0

#define MCPWM_GEN2_STMP_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x00ac)
/* MCPWM_GEN2_B_SHDW_FULL : RO ;bitpos:[9] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  PWM generator 2 time stamp
 B's shadow reg is filled and waiting to be transferred to B's active reg. If cleared  B's active reg has been updated with shadow reg latest value*/
#define MCPWM_GEN2_B_SHDW_FULL  (BIT(9))
#define MCPWM_GEN2_B_SHDW_FULL_M  (BIT(9))
#define MCPWM_GEN2_B_SHDW_FULL_V  0x1
#define MCPWM_GEN2_B_SHDW_FULL_S  9
/* MCPWM_GEN2_A_SHDW_FULL : RO ;bitpos:[8] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  PWM generator 2 time stamp
 A's shadow reg is filled and waiting to be transferred to A's active reg. If cleared  A's active reg has been updated with shadow reg latest value*/
#define MCPWM_GEN2_A_SHDW_FULL  (BIT(8))
#define MCPWM_GEN2_A_SHDW_FULL_M  (BIT(8))
#define MCPWM_GEN2_A_SHDW_FULL_V  0x1
#define MCPWM_GEN2_A_SHDW_FULL_S  8
/* MCPWM_GEN2_B_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: Update method for PWM generator 2 time stamp B's active reg.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_GEN2_B_UPMETHOD  0x0000000F
#define MCPWM_GEN2_B_UPMETHOD_M  ((MCPWM_GEN2_B_UPMETHOD_V)<<(MCPWM_GEN2_B_UPMETHOD_S))
#define MCPWM_GEN2_B_UPMETHOD_V  0xF
#define MCPWM_GEN2_B_UPMETHOD_S  4
/* MCPWM_GEN2_A_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for PWM generator 2 time stamp A's active reg.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync  bit3: disable update*/
#define MCPWM_GEN2_A_UPMETHOD  0x0000000F
#define MCPWM_GEN2_A_UPMETHOD_M  ((MCPWM_GEN2_A_UPMETHOD_V)<<(MCPWM_GEN2_A_UPMETHOD_S))
#define MCPWM_GEN2_A_UPMETHOD_V  0xF
#define MCPWM_GEN2_A_UPMETHOD_S  0

#define MCPWM_GEN2_TSTMP_A_REG(i)          (REG_MCPWM_BASE(i) + 0x00b0)
/* MCPWM_GEN2_A : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: PWM generator 2 time stamp A's shadow reg*/
#define MCPWM_GEN2_A  0x0000FFFF
#define MCPWM_GEN2_A_M  ((MCPWM_GEN2_A_V)<<(MCPWM_GEN2_A_S))
#define MCPWM_GEN2_A_V  0xFFFF
#define MCPWM_GEN2_A_S  0

#define MCPWM_GEN2_TSTMP_B_REG(i)          (REG_MCPWM_BASE(i) + 0x00b4)
/* MCPWM_GEN2_B : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: PWM generator 2 time stamp B's shadow reg*/
#define MCPWM_GEN2_B  0x0000FFFF
#define MCPWM_GEN2_B_M  ((MCPWM_GEN2_B_V)<<(MCPWM_GEN2_B_S))
#define MCPWM_GEN2_B_V  0xFFFF
#define MCPWM_GEN2_B_S  0

#define MCPWM_GEN2_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x00b8)
/* MCPWM_GEN2_T1_SEL : R/W ;bitpos:[9:7] ;default: 3'd0 ; */
/*description: Source selection for PWM generate2 event_t1  take effect immediately
  0: fault_event0  1: fault_event1  2: fault_event2  3: sync_taken  4: none*/
#define MCPWM_GEN2_T1_SEL  0x00000007
#define MCPWM_GEN2_T1_SEL_M  ((MCPWM_GEN2_T1_SEL_V)<<(MCPWM_GEN2_T1_SEL_S))
#define MCPWM_GEN2_T1_SEL_V  0x7
#define MCPWM_GEN2_T1_SEL_S  7
/* MCPWM_GEN2_T0_SEL : R/W ;bitpos:[6:4] ;default: 3'd0 ; */
/*description: Source selection for PWM generate2 event_t0  take effect immediately
  0: fault_event0  1: fault_event1  2: fault_event2  3: sync_taken  4: none*/
#define MCPWM_GEN2_T0_SEL  0x00000007
#define MCPWM_GEN2_T0_SEL_M  ((MCPWM_GEN2_T0_SEL_V)<<(MCPWM_GEN2_T0_SEL_S))
#define MCPWM_GEN2_T0_SEL_V  0x7
#define MCPWM_GEN2_T0_SEL_S  4
/* MCPWM_GEN2_CFG_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: Update method for PWM generate2's active reg of configuration.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: sync. bit3: disable update*/
#define MCPWM_GEN2_CFG_UPMETHOD  0x0000000F
#define MCPWM_GEN2_CFG_UPMETHOD_M  ((MCPWM_GEN2_CFG_UPMETHOD_V)<<(MCPWM_GEN2_CFG_UPMETHOD_S))
#define MCPWM_GEN2_CFG_UPMETHOD_V  0xF
#define MCPWM_GEN2_CFG_UPMETHOD_S  0

#define MCPWM_GEN2_FORCE_REG(i)          (REG_MCPWM_BASE(i) + 0x00bc)
/* MCPWM_GEN2_B_NCIFORCE_MODE : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Non-continuous immediate software force mode for PWM2B  0: disabled
  1: low  2: high  3: disabled*/
#define MCPWM_GEN2_B_NCIFORCE_MODE  0x00000003
#define MCPWM_GEN2_B_NCIFORCE_MODE_M  ((MCPWM_GEN2_B_NCIFORCE_MODE_V)<<(MCPWM_GEN2_B_NCIFORCE_MODE_S))
#define MCPWM_GEN2_B_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN2_B_NCIFORCE_MODE_S  14
/* MCPWM_GEN2_B_NCIFORCE : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: Non-continuous immediate software force trigger for PWM2B  a
 toggle will trigger a force event*/
#define MCPWM_GEN2_B_NCIFORCE  (BIT(13))
#define MCPWM_GEN2_B_NCIFORCE_M  (BIT(13))
#define MCPWM_GEN2_B_NCIFORCE_V  0x1
#define MCPWM_GEN2_B_NCIFORCE_S  13
/* MCPWM_GEN2_A_NCIFORCE_MODE : R/W ;bitpos:[12:11] ;default: 2'd0 ; */
/*description: Non-continuous immediate software force mode for PWM2A  0: disabled
  1: low  2: high  3: disabled*/
#define MCPWM_GEN2_A_NCIFORCE_MODE  0x00000003
#define MCPWM_GEN2_A_NCIFORCE_MODE_M  ((MCPWM_GEN2_A_NCIFORCE_MODE_V)<<(MCPWM_GEN2_A_NCIFORCE_MODE_S))
#define MCPWM_GEN2_A_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN2_A_NCIFORCE_MODE_S  11
/* MCPWM_GEN2_A_NCIFORCE : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: Non-continuous immediate software force trigger for PWM2A  a
 toggle will trigger a force event*/
#define MCPWM_GEN2_A_NCIFORCE  (BIT(10))
#define MCPWM_GEN2_A_NCIFORCE_M  (BIT(10))
#define MCPWM_GEN2_A_NCIFORCE_V  0x1
#define MCPWM_GEN2_A_NCIFORCE_S  10
/* MCPWM_GEN2_B_CNTUFORCE_MODE : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Continuous software force mode for PWM2B. 0: disabled  1: low
  2: high  3: disabled*/
#define MCPWM_GEN2_B_CNTUFORCE_MODE  0x00000003
#define MCPWM_GEN2_B_CNTUFORCE_MODE_M  ((MCPWM_GEN2_B_CNTUFORCE_MODE_V)<<(MCPWM_GEN2_B_CNTUFORCE_MODE_S))
#define MCPWM_GEN2_B_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN2_B_CNTUFORCE_MODE_S  8
/* MCPWM_GEN2_A_CNTUFORCE_MODE : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Continuous software force mode for PWM2A. 0: disabled  1: low
  2: high  3: disabled*/
#define MCPWM_GEN2_A_CNTUFORCE_MODE  0x00000003
#define MCPWM_GEN2_A_CNTUFORCE_MODE_M  ((MCPWM_GEN2_A_CNTUFORCE_MODE_V)<<(MCPWM_GEN2_A_CNTUFORCE_MODE_S))
#define MCPWM_GEN2_A_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN2_A_CNTUFORCE_MODE_S  6
/* MCPWM_GEN2_CNTUFORCE_UPMETHOD : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: Update method for continuous software force of PWM generator2.
 0: immediate  bit0: TEZ  bit1: TEP  bit2: TEA  bit3: TEB  bit4: sync  bit5: disable update. (TEA/B here and below means an event generated when timer value equals A/B register)*/
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD  0x0000003F
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD_M  ((MCPWM_GEN2_CNTUFORCE_UPMETHOD_V)<<(MCPWM_GEN2_CNTUFORCE_UPMETHOD_S))
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD_V  0x3F
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD_S  0

#define MCPWM_GEN2_A_REG(i)          (REG_MCPWM_BASE(i) + 0x00c0)
/* MCPWM_GEN2_A_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event_t1 when timer decreasing.
 0: no change  1: low  2: high  3: toggle*/
#define MCPWM_GEN2_A_DT1  0x00000003
#define MCPWM_GEN2_A_DT1_M  ((MCPWM_GEN2_A_DT1_V)<<(MCPWM_GEN2_A_DT1_S))
#define MCPWM_GEN2_A_DT1_V  0x3
#define MCPWM_GEN2_A_DT1_S  22
/* MCPWM_GEN2_A_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event_t0 when timer decreasing*/
#define MCPWM_GEN2_A_DT0  0x00000003
#define MCPWM_GEN2_A_DT0_M  ((MCPWM_GEN2_A_DT0_V)<<(MCPWM_GEN2_A_DT0_S))
#define MCPWM_GEN2_A_DT0_V  0x3
#define MCPWM_GEN2_A_DT0_S  20
/* MCPWM_GEN2_A_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEB when timer decreasing*/
#define MCPWM_GEN2_A_DTEB  0x00000003
#define MCPWM_GEN2_A_DTEB_M  ((MCPWM_GEN2_A_DTEB_V)<<(MCPWM_GEN2_A_DTEB_S))
#define MCPWM_GEN2_A_DTEB_V  0x3
#define MCPWM_GEN2_A_DTEB_S  18
/* MCPWM_GEN2_A_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEA when timer decreasing*/
#define MCPWM_GEN2_A_DTEA  0x00000003
#define MCPWM_GEN2_A_DTEA_M  ((MCPWM_GEN2_A_DTEA_V)<<(MCPWM_GEN2_A_DTEA_S))
#define MCPWM_GEN2_A_DTEA_V  0x3
#define MCPWM_GEN2_A_DTEA_S  16
/* MCPWM_GEN2_A_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEP when timer decreasing*/
#define MCPWM_GEN2_A_DTEP  0x00000003
#define MCPWM_GEN2_A_DTEP_M  ((MCPWM_GEN2_A_DTEP_V)<<(MCPWM_GEN2_A_DTEP_S))
#define MCPWM_GEN2_A_DTEP_V  0x3
#define MCPWM_GEN2_A_DTEP_S  14
/* MCPWM_GEN2_A_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEZ when timer decreasing*/
#define MCPWM_GEN2_A_DTEZ  0x00000003
#define MCPWM_GEN2_A_DTEZ_M  ((MCPWM_GEN2_A_DTEZ_V)<<(MCPWM_GEN2_A_DTEZ_S))
#define MCPWM_GEN2_A_DTEZ_V  0x3
#define MCPWM_GEN2_A_DTEZ_S  12
/* MCPWM_GEN2_A_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event_t1 when timer increasing*/
#define MCPWM_GEN2_A_UT1  0x00000003
#define MCPWM_GEN2_A_UT1_M  ((MCPWM_GEN2_A_UT1_V)<<(MCPWM_GEN2_A_UT1_S))
#define MCPWM_GEN2_A_UT1_V  0x3
#define MCPWM_GEN2_A_UT1_S  10
/* MCPWM_GEN2_A_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event_t0 when timer increasing*/
#define MCPWM_GEN2_A_UT0  0x00000003
#define MCPWM_GEN2_A_UT0_M  ((MCPWM_GEN2_A_UT0_V)<<(MCPWM_GEN2_A_UT0_S))
#define MCPWM_GEN2_A_UT0_V  0x3
#define MCPWM_GEN2_A_UT0_S  8
/* MCPWM_GEN2_A_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEB when timer increasing*/
#define MCPWM_GEN2_A_UTEB  0x00000003
#define MCPWM_GEN2_A_UTEB_M  ((MCPWM_GEN2_A_UTEB_V)<<(MCPWM_GEN2_A_UTEB_S))
#define MCPWM_GEN2_A_UTEB_V  0x3
#define MCPWM_GEN2_A_UTEB_S  6
/* MCPWM_GEN2_A_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEA when timer increasing*/
#define MCPWM_GEN2_A_UTEA  0x00000003
#define MCPWM_GEN2_A_UTEA_M  ((MCPWM_GEN2_A_UTEA_V)<<(MCPWM_GEN2_A_UTEA_S))
#define MCPWM_GEN2_A_UTEA_V  0x3
#define MCPWM_GEN2_A_UTEA_S  4
/* MCPWM_GEN2_A_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEP when timer increasing*/
#define MCPWM_GEN2_A_UTEP  0x00000003
#define MCPWM_GEN2_A_UTEP_M  ((MCPWM_GEN2_A_UTEP_V)<<(MCPWM_GEN2_A_UTEP_S))
#define MCPWM_GEN2_A_UTEP_V  0x3
#define MCPWM_GEN2_A_UTEP_S  2
/* MCPWM_GEN2_A_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: Action on PWM2A triggered by event TEZ when timer increasing*/
#define MCPWM_GEN2_A_UTEZ  0x00000003
#define MCPWM_GEN2_A_UTEZ_M  ((MCPWM_GEN2_A_UTEZ_V)<<(MCPWM_GEN2_A_UTEZ_S))
#define MCPWM_GEN2_A_UTEZ_V  0x3
#define MCPWM_GEN2_A_UTEZ_S  0

