espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_FH2_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x00d8)
/* MCPWM_FH2_B_OST_U : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM2B when fault event occurs and timer
 is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_B_OST_U  0x00000003
#define MCPWM_FH2_B_OST_U_M  ((MCPWM_FH2_B_OST_U_V)<<(MCPWM_FH2_B_OST_U_S))
#define MCPWM_FH2_B_OST_U_V  0x3
#define MCPWM_FH2_B_OST_U_S  22
/* MCPWM_FH2_B_OST_D : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM2B when fault event occurs and timer
 is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_B_OST_D  0x00000003
#define MCPWM_FH2_B_OST_D_M  ((MCPWM_FH2_B_OST_D_V)<<(MCPWM_FH2_B_OST_D_S))
#define MCPWM_FH2_B_OST_D_V  0x3
#define MCPWM_FH2_B_OST_D_S  20
/* MCPWM_FH2_B_CBC_U : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM2B when fault event occurs and
 timer is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_B_CBC_U  0x00000003
#define MCPWM_FH2_B_CBC_U_M  ((MCPWM_FH2_B_CBC_U_V)<<(MCPWM_FH2_B_CBC_U_S))
#define MCPWM_FH2_B_CBC_U_V  0x3
#define MCPWM_FH2_B_CBC_U_S  18
/* MCPWM_FH2_B_CBC_D : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM2B when fault event occurs and
 timer is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_B_CBC_D  0x00000003
#define MCPWM_FH2_B_CBC_D_M  ((MCPWM_FH2_B_CBC_D_V)<<(MCPWM_FH2_B_CBC_D_S))
#define MCPWM_FH2_B_CBC_D_V  0x3
#define MCPWM_FH2_B_CBC_D_S  16
/* MCPWM_FH2_A_OST_U : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM2A when fault event occurs and timer
 is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_A_OST_U  0x00000003
#define MCPWM_FH2_A_OST_U_M  ((MCPWM_FH2_A_OST_U_V)<<(MCPWM_FH2_A_OST_U_S))
#define MCPWM_FH2_A_OST_U_V  0x3
#define MCPWM_FH2_A_OST_U_S  14
/* MCPWM_FH2_A_OST_D : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: One-shot mode action on PWM2A when fault event occurs and timer
 is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_A_OST_D  0x00000003
#define MCPWM_FH2_A_OST_D_M  ((MCPWM_FH2_A_OST_D_V)<<(MCPWM_FH2_A_OST_D_S))
#define MCPWM_FH2_A_OST_D_V  0x3
#define MCPWM_FH2_A_OST_D_S  12
/* MCPWM_FH2_A_CBC_U : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM2A when fault event occurs and
 timer is increasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_A_CBC_U  0x00000003
#define MCPWM_FH2_A_CBC_U_M  ((MCPWM_FH2_A_CBC_U_V)<<(MCPWM_FH2_A_CBC_U_S))
#define MCPWM_FH2_A_CBC_U_V  0x3
#define MCPWM_FH2_A_CBC_U_S  10
/* MCPWM_FH2_A_CBC_D : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: Cycle-by-cycle mode action on PWM2A when fault event occurs and
 timer is decreasing. 0: do nothing  1: force lo  2: force hi  3: toggle*/
#define MCPWM_FH2_A_CBC_D  0x00000003
#define MCPWM_FH2_A_CBC_D_M  ((MCPWM_FH2_A_CBC_D_V)<<(MCPWM_FH2_A_CBC_D_S))
#define MCPWM_FH2_A_CBC_D_V  0x3
#define MCPWM_FH2_A_CBC_D_S  8
/* MCPWM_FH2_F0_OST : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: event_f0 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH2_F0_OST  (BIT(7))
#define MCPWM_FH2_F0_OST_M  (BIT(7))
#define MCPWM_FH2_F0_OST_V  0x1
#define MCPWM_FH2_F0_OST_S  7
/* MCPWM_FH2_F1_OST : R/W ;bitpos:[6] ;default: 1'd0 ; */
/*description: event_f1 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH2_F1_OST  (BIT(6))
#define MCPWM_FH2_F1_OST_M  (BIT(6))
#define MCPWM_FH2_F1_OST_V  0x1
#define MCPWM_FH2_F1_OST_S  6
/* MCPWM_FH2_F2_OST : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: event_f2 will trigger one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH2_F2_OST  (BIT(5))
#define MCPWM_FH2_F2_OST_M  (BIT(5))
#define MCPWM_FH2_F2_OST_V  0x1
#define MCPWM_FH2_F2_OST_S  5
/* MCPWM_FH2_SW_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: Enable register for software force one-shot mode action. 0: disable  1: enable*/
#define MCPWM_FH2_SW_OST  (BIT(4))
#define MCPWM_FH2_SW_OST_M  (BIT(4))
#define MCPWM_FH2_SW_OST_V  0x1
#define MCPWM_FH2_SW_OST_S  4
/* MCPWM_FH2_F0_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: event_f0 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH2_F0_CBC  (BIT(3))
#define MCPWM_FH2_F0_CBC_M  (BIT(3))
#define MCPWM_FH2_F0_CBC_V  0x1
#define MCPWM_FH2_F0_CBC_S  3
/* MCPWM_FH2_F1_CBC : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: event_f1 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH2_F1_CBC  (BIT(2))
#define MCPWM_FH2_F1_CBC_M  (BIT(2))
#define MCPWM_FH2_F1_CBC_V  0x1
#define MCPWM_FH2_F1_CBC_S  2
/* MCPWM_FH2_F2_CBC : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: event_f2 will trigger cycle-by-cycle mode action. 0: disable  1: enable*/
#define MCPWM_FH2_F2_CBC  (BIT(1))
#define MCPWM_FH2_F2_CBC_M  (BIT(1))
#define MCPWM_FH2_F2_CBC_V  0x1
#define MCPWM_FH2_F2_CBC_S  1
/* MCPWM_FH2_SW_CBC : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: Enable register for software force cycle-by-cycle mode action.
 0: disable  1: enable*/
#define MCPWM_FH2_SW_CBC  (BIT(0))
#define MCPWM_FH2_SW_CBC_M  (BIT(0))
#define MCPWM_FH2_SW_CBC_V  0x1
#define MCPWM_FH2_SW_CBC_S  0

#define MCPWM_FH2_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x00dc)
/* MCPWM_FH2_FORCE_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) triggers a
 one-shot mode action*/
#define MCPWM_FH2_FORCE_OST  (BIT(4))
#define MCPWM_FH2_FORCE_OST_M  (BIT(4))
#define MCPWM_FH2_FORCE_OST_V  0x1
#define MCPWM_FH2_FORCE_OST_S  4
/* MCPWM_FH2_FORCE_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: A toggle triggers a cycle-by-cycle mode action*/
#define MCPWM_FH2_FORCE_CBC  (BIT(3))
#define MCPWM_FH2_FORCE_CBC_M  (BIT(3))
#define MCPWM_FH2_FORCE_CBC_V  0x1
#define MCPWM_FH2_FORCE_CBC_S  3
/* MCPWM_FH2_CBCPULSE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: The cycle-by-cycle mode action refresh moment selection. Bit0: TEZ  bit1:TEP*/
#define MCPWM_FH2_CBCPULSE  0x00000003
#define MCPWM_FH2_CBCPULSE_M  ((MCPWM_FH2_CBCPULSE_V)<<(MCPWM_FH2_CBCPULSE_S))
#define MCPWM_FH2_CBCPULSE_V  0x3
#define MCPWM_FH2_CBCPULSE_S  1
/* MCPWM_FH2_CLR_OST : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: A toggle will clear on going one-shot mode action*/
#define MCPWM_FH2_CLR_OST  (BIT(0))
#define MCPWM_FH2_CLR_OST_M  (BIT(0))
#define MCPWM_FH2_CLR_OST_V  0x1
#define MCPWM_FH2_CLR_OST_S  0

#define MCPWM_FH2_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x00e0)
/* MCPWM_FH2_OST_ON : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  an one-shot mode action is on going*/
#define MCPWM_FH2_OST_ON  (BIT(1))
#define MCPWM_FH2_OST_ON_M  (BIT(1))
#define MCPWM_FH2_OST_ON_V  0x1
#define MCPWM_FH2_OST_ON_S  1
/* MCPWM_FH2_CBC_ON : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  an cycle-by-cycle mode action is on going*/
#define MCPWM_FH2_CBC_ON  (BIT(0))
#define MCPWM_FH2_CBC_ON_M  (BIT(0))
#define MCPWM_FH2_CBC_ON_V  0x1
#define MCPWM_FH2_CBC_ON_S  0

#define MCPWM_FAULT_DETECT_REG(i)          (REG_MCPWM_BASE(i) + 0x00e4)
/* MCPWM_EVENT_F2 : RO ;bitpos:[8] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  event_f2 is on going*/
#define MCPWM_EVENT_F2  (BIT(8))
#define MCPWM_EVENT_F2_M  (BIT(8))
#define MCPWM_EVENT_F2_V  0x1
#define MCPWM_EVENT_F2_S  8
/* MCPWM_EVENT_F1 : RO ;bitpos:[7] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  event_f1 is on going*/
#define MCPWM_EVENT_F1  (BIT(7))
#define MCPWM_EVENT_F1_M  (BIT(7))
#define MCPWM_EVENT_F1_V  0x1
#define MCPWM_EVENT_F1_S  7
/* MCPWM_EVENT_F0 : RO ;bitpos:[6] ;default: 1'd0 ; */
/*description: Set and reset by hardware. If set  event_f0 is on going*/
#define MCPWM_EVENT_F0  (BIT(6))
#define MCPWM_EVENT_F0_M  (BIT(6))
#define MCPWM_EVENT_F0_V  0x1
#define MCPWM_EVENT_F0_S  6
/* MCPWM_F2_POLE : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: Set event_f2 trigger polarity on FAULT2 source from GPIO matrix.
 0: level low  1: level high*/
#define MCPWM_F2_POLE  (BIT(5))
#define MCPWM_F2_POLE_M  (BIT(5))
#define MCPWM_F2_POLE_V  0x1
#define MCPWM_F2_POLE_S  5
/* MCPWM_F1_POLE : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: Set event_f1 trigger polarity on FAULT2 source from GPIO matrix.
 0: level low  1: level high*/
#define MCPWM_F1_POLE  (BIT(4))
#define MCPWM_F1_POLE_M  (BIT(4))
#define MCPWM_F1_POLE_V  0x1
#define MCPWM_F1_POLE_S  4
/* MCPWM_F0_POLE : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: Set event_f0 trigger polarity on FAULT2 source from GPIO matrix.
 0: level low  1: level high*/
#define MCPWM_F0_POLE  (BIT(3))
#define MCPWM_F0_POLE_M  (BIT(3))
#define MCPWM_F0_POLE_V  0x1
#define MCPWM_F0_POLE_S  3
/* MCPWM_F2_EN : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: Set to enable generation of event_f2*/
#define MCPWM_F2_EN  (BIT(2))
#define MCPWM_F2_EN_M  (BIT(2))
#define MCPWM_F2_EN_V  0x1
#define MCPWM_F2_EN_S  2
/* MCPWM_F1_EN : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: Set to enable generation of event_f1*/
#define MCPWM_F1_EN  (BIT(1))
#define MCPWM_F1_EN_M  (BIT(1))
#define MCPWM_F1_EN_V  0x1
#define MCPWM_F1_EN_S  1
/* MCPWM_F0_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: Set to enable generation of event_f0*/
#define MCPWM_F0_EN  (BIT(0))
#define MCPWM_F0_EN_M  (BIT(0))
#define MCPWM_F0_EN_V  0x1
#define MCPWM_F0_EN_S  0

#define MCPWM_CAP_TIMER_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x00e8)
/* MCPWM_CAP_SYNC_SW : WO ;bitpos:[5] ;default: 1'd0 ; */
/*description: Set this bit to force a capture timer sync  capture timer is
 loaded with value in phase register.*/
#define MCPWM_CAP_SYNC_SW  (BIT(5))
#define MCPWM_CAP_SYNC_SW_M  (BIT(5))
#define MCPWM_CAP_SYNC_SW_V  0x1
#define MCPWM_CAP_SYNC_SW_S  5
/* MCPWM_CAP_SYNCI_SEL : R/W ;bitpos:[4:2] ;default: 3'd0 ; */
/*description: Capture module sync input selection. 0: none  1: timer0 synco
  2: timer1 synco  3: timer2 synco  4: SYNC0 from GPIO matrix  5: SYNC1 from GPIO matrix  6: SYNC2 from GPIO matrix*/
#define MCPWM_CAP_SYNCI_SEL  0x00000007
#define MCPWM_CAP_SYNCI_SEL_M  ((MCPWM_CAP_SYNCI_SEL_V)<<(MCPWM_CAP_SYNCI_SEL_S))
#define MCPWM_CAP_SYNCI_SEL_V  0x7
#define MCPWM_CAP_SYNCI_SEL_S  2
/* MCPWM_CAP_SYNCI_EN : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: When set  capture timer sync is enabled.*/
#define MCPWM_CAP_SYNCI_EN  (BIT(1))
#define MCPWM_CAP_SYNCI_EN_M  (BIT(1))
#define MCPWM_CAP_SYNCI_EN_V  0x1
#define MCPWM_CAP_SYNCI_EN_S  1
/* MCPWM_CAP_TIMER_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: When set  capture timer incrementing under APB_clk is enabled.*/
#define MCPWM_CAP_TIMER_EN  (BIT(0))
#define MCPWM_CAP_TIMER_EN_M  (BIT(0))
#define MCPWM_CAP_TIMER_EN_V  0x1
#define MCPWM_CAP_TIMER_EN_S  0

#define MCPWM_CAP_TIMER_PHASE_REG(i)          (REG_MCPWM_BASE(i) + 0x00ec)
/* MCPWM_CAP_PHASE : R/W ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: Phase value for capture timer sync operation.*/
#define MCPWM_CAP_PHASE  0xFFFFFFFF
#define MCPWM_CAP_PHASE_M  ((MCPWM_CAP_PHASE_V)<<(MCPWM_CAP_PHASE_S))
#define MCPWM_CAP_PHASE_V  0xFFFFFFFF
#define MCPWM_CAP_PHASE_S  0

#define MCPWM_CAP_CH0_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x00f0)
/* MCPWM_CAP0_SW : WO ;bitpos:[12] ;default: 1'd0 ; */
/*description: Write 1 will trigger a software forced capture on channel 0*/
#define MCPWM_CAP0_SW  (BIT(12))
#define MCPWM_CAP0_SW_M  (BIT(12))
#define MCPWM_CAP0_SW_V  0x1
#define MCPWM_CAP0_SW_S  12
/* MCPWM_CAP0_IN_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: When set  CAP0 form GPIO matrix is inverted before prescale*/
#define MCPWM_CAP0_IN_INVERT  (BIT(11))
#define MCPWM_CAP0_IN_INVERT_M  (BIT(11))
#define MCPWM_CAP0_IN_INVERT_V  0x1
#define MCPWM_CAP0_IN_INVERT_S  11
/* MCPWM_CAP0_PRESCALE : R/W ;bitpos:[10:3] ;default: 8'd0 ; */
/*description: Value of prescale on possitive edge of CAP0. Prescale value =
 PWM_CAP0_PRESCALE + 1*/
#define MCPWM_CAP0_PRESCALE  0x000000FF
#define MCPWM_CAP0_PRESCALE_M  ((MCPWM_CAP0_PRESCALE_V)<<(MCPWM_CAP0_PRESCALE_S))
#define MCPWM_CAP0_PRESCALE_V  0xFF
#define MCPWM_CAP0_PRESCALE_S  3
/* MCPWM_CAP0_MODE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: Edge of capture on channel 0 after prescale.  bit0: negedge cap
 en  bit1: posedge cap en*/
#define MCPWM_CAP0_MODE  0x00000003
#define MCPWM_CAP0_MODE_M  ((MCPWM_CAP0_MODE_V)<<(MCPWM_CAP0_MODE_S))
#define MCPWM_CAP0_MODE_V  0x3
#define MCPWM_CAP0_MODE_S  1
/* MCPWM_CAP0_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: When set  capture on channel 0 is enabled*/
#define MCPWM_CAP0_EN  (BIT(0))
#define MCPWM_CAP0_EN_M  (BIT(0))
#define MCPWM_CAP0_EN_V  0x1
#define MCPWM_CAP0_EN_S  0

#define MCPWM_CAP_CH1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x00f4)
/* MCPWM_CAP1_SW : WO ;bitpos:[12] ;default: 1'd0 ; */
/*description: Write 1 will trigger a software forced capture on channel 1*/
#define MCPWM_CAP1_SW  (BIT(12))
#define MCPWM_CAP1_SW_M  (BIT(12))
#define MCPWM_CAP1_SW_V  0x1
#define MCPWM_CAP1_SW_S  12
/* MCPWM_CAP1_IN_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: When set  CAP1 form GPIO matrix is inverted before prescale*/
#define MCPWM_CAP1_IN_INVERT  (BIT(11))
#define MCPWM_CAP1_IN_INVERT_M  (BIT(11))
#define MCPWM_CAP1_IN_INVERT_V  0x1
#define MCPWM_CAP1_IN_INVERT_S  11
/* MCPWM_CAP1_PRESCALE : R/W ;bitpos:[10:3] ;default: 8'd0 ; */
/*description: Value of prescale on possitive edge of CAP1. Prescale value =
 PWM_CAP1_PRESCALE + 1*/
#define MCPWM_CAP1_PRESCALE  0x000000FF
#define MCPWM_CAP1_PRESCALE_M  ((MCPWM_CAP1_PRESCALE_V)<<(MCPWM_CAP1_PRESCALE_S))
#define MCPWM_CAP1_PRESCALE_V  0xFF
#define MCPWM_CAP1_PRESCALE_S  3
/* MCPWM_CAP1_MODE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: Edge of capture on channel 1 after prescale.  bit0: negedge cap
 en  bit1: posedge cap en*/
#define MCPWM_CAP1_MODE  0x00000003
#define MCPWM_CAP1_MODE_M  ((MCPWM_CAP1_MODE_V)<<(MCPWM_CAP1_MODE_S))
#define MCPWM_CAP1_MODE_V  0x3
#define MCPWM_CAP1_MODE_S  1
/* MCPWM_CAP1_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: When set  capture on channel 1 is enabled*/
#define MCPWM_CAP1_EN  (BIT(0))
#define MCPWM_CAP1_EN_M  (BIT(0))
#define MCPWM_CAP1_EN_V  0x1
#define MCPWM_CAP1_EN_S  0

