espressif/esp-idf/components/soc/esp32s2beta/include/soc/mcpwm_reg.h
#define MCPWM_CAP_CH2_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x00f8)
/* MCPWM_CAP2_SW : WO ;bitpos:[12] ;default: 1'd0 ; */
/*description: Write 1 will trigger a software forced capture on channel 2*/
#define MCPWM_CAP2_SW  (BIT(12))
#define MCPWM_CAP2_SW_M  (BIT(12))
#define MCPWM_CAP2_SW_V  0x1
#define MCPWM_CAP2_SW_S  12
/* MCPWM_CAP2_IN_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: When set  CAP2 form GPIO matrix is inverted before prescale*/
#define MCPWM_CAP2_IN_INVERT  (BIT(11))
#define MCPWM_CAP2_IN_INVERT_M  (BIT(11))
#define MCPWM_CAP2_IN_INVERT_V  0x1
#define MCPWM_CAP2_IN_INVERT_S  11
/* MCPWM_CAP2_PRESCALE : R/W ;bitpos:[10:3] ;default: 8'd0 ; */
/*description: Value of prescale on possitive edge of CAP2. Prescale value =
 PWM_CAP2_PRESCALE + 1*/
#define MCPWM_CAP2_PRESCALE  0x000000FF
#define MCPWM_CAP2_PRESCALE_M  ((MCPWM_CAP2_PRESCALE_V)<<(MCPWM_CAP2_PRESCALE_S))
#define MCPWM_CAP2_PRESCALE_V  0xFF
#define MCPWM_CAP2_PRESCALE_S  3
/* MCPWM_CAP2_MODE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: Edge of capture on channel 2 after prescale.  bit0: negedge cap
 en  bit1: posedge cap en*/
#define MCPWM_CAP2_MODE  0x00000003
#define MCPWM_CAP2_MODE_M  ((MCPWM_CAP2_MODE_V)<<(MCPWM_CAP2_MODE_S))
#define MCPWM_CAP2_MODE_V  0x3
#define MCPWM_CAP2_MODE_S  1
/* MCPWM_CAP2_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: When set  capture on channel 2 is enabled*/
#define MCPWM_CAP2_EN  (BIT(0))
#define MCPWM_CAP2_EN_M  (BIT(0))
#define MCPWM_CAP2_EN_V  0x1
#define MCPWM_CAP2_EN_S  0

#define MCPWM_CAP_CH0_REG(i)          (REG_MCPWM_BASE(i) + 0x00fc)
/* MCPWM_CAP0_VALUE : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: Value of last capture on channel 0*/
#define MCPWM_CAP0_VALUE  0xFFFFFFFF
#define MCPWM_CAP0_VALUE_M  ((MCPWM_CAP0_VALUE_V)<<(MCPWM_CAP0_VALUE_S))
#define MCPWM_CAP0_VALUE_V  0xFFFFFFFF
#define MCPWM_CAP0_VALUE_S  0

#define MCPWM_CAP_CH1_REG(i)          (REG_MCPWM_BASE(i) + 0x0100)
/* MCPWM_CAP1_VALUE : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: Value of last capture on channel 1*/
#define MCPWM_CAP1_VALUE  0xFFFFFFFF
#define MCPWM_CAP1_VALUE_M  ((MCPWM_CAP1_VALUE_V)<<(MCPWM_CAP1_VALUE_S))
#define MCPWM_CAP1_VALUE_V  0xFFFFFFFF
#define MCPWM_CAP1_VALUE_S  0

#define MCPWM_CAP_CH2_REG(i)          (REG_MCPWM_BASE(i) + 0x0104)
/* MCPWM_CAP2_VALUE : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: Value of last capture on channel 2*/
#define MCPWM_CAP2_VALUE  0xFFFFFFFF
#define MCPWM_CAP2_VALUE_M  ((MCPWM_CAP2_VALUE_V)<<(MCPWM_CAP2_VALUE_S))
#define MCPWM_CAP2_VALUE_V  0xFFFFFFFF
#define MCPWM_CAP2_VALUE_S  0

#define MCPWM_CAP_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x0108)
/* MCPWM_CAP2_EDGE : RO ;bitpos:[2] ;default: 1'd0 ; */
/*description: Edge of last capture trigger on channel 2  0: posedge  1: negedge*/
#define MCPWM_CAP2_EDGE  (BIT(2))
#define MCPWM_CAP2_EDGE_M  (BIT(2))
#define MCPWM_CAP2_EDGE_V  0x1
#define MCPWM_CAP2_EDGE_S  2
/* MCPWM_CAP1_EDGE : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: Edge of last capture trigger on channel 1  0: posedge  1: negedge*/
#define MCPWM_CAP1_EDGE  (BIT(1))
#define MCPWM_CAP1_EDGE_M  (BIT(1))
#define MCPWM_CAP1_EDGE_V  0x1
#define MCPWM_CAP1_EDGE_S  1
/* MCPWM_CAP0_EDGE : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: Edge of last capture trigger on channel 0  0: posedge  1: negedge*/
#define MCPWM_CAP0_EDGE  (BIT(0))
#define MCPWM_CAP0_EDGE_M  (BIT(0))
#define MCPWM_CAP0_EDGE_V  0x1
#define MCPWM_CAP0_EDGE_S  0

#define MCPWM_UPDATE_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x010c)
/* MCPWM_OP2_FORCE_UP : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) will trigger
 a forced update of active registers in PWM operator 2*/
#define MCPWM_OP2_FORCE_UP  (BIT(7))
#define MCPWM_OP2_FORCE_UP_M  (BIT(7))
#define MCPWM_OP2_FORCE_UP_V  0x1
#define MCPWM_OP2_FORCE_UP_S  7
/* MCPWM_OP2_UP_EN : R/W ;bitpos:[6] ;default: 1'd1 ; */
/*description: When set and PWM_GLOBAL_UP_EN is set  update of active registers
 in PWM operator 2 are enabled*/
#define MCPWM_OP2_UP_EN  (BIT(6))
#define MCPWM_OP2_UP_EN_M  (BIT(6))
#define MCPWM_OP2_UP_EN_V  0x1
#define MCPWM_OP2_UP_EN_S  6
/* MCPWM_OP1_FORCE_UP : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) will trigger
 a forced update of active registers in PWM operator 1*/
#define MCPWM_OP1_FORCE_UP  (BIT(5))
#define MCPWM_OP1_FORCE_UP_M  (BIT(5))
#define MCPWM_OP1_FORCE_UP_V  0x1
#define MCPWM_OP1_FORCE_UP_S  5
/* MCPWM_OP1_UP_EN : R/W ;bitpos:[4] ;default: 1'd1 ; */
/*description: When set and PWM_GLOBAL_UP_EN is set  update of active registers
 in PWM operator 1 are enabled*/
#define MCPWM_OP1_UP_EN  (BIT(4))
#define MCPWM_OP1_UP_EN_M  (BIT(4))
#define MCPWM_OP1_UP_EN_V  0x1
#define MCPWM_OP1_UP_EN_S  4
/* MCPWM_OP0_FORCE_UP : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) will trigger
 a forced update of active registers in PWM operator 0*/
#define MCPWM_OP0_FORCE_UP  (BIT(3))
#define MCPWM_OP0_FORCE_UP_M  (BIT(3))
#define MCPWM_OP0_FORCE_UP_V  0x1
#define MCPWM_OP0_FORCE_UP_S  3
/* MCPWM_OP0_UP_EN : R/W ;bitpos:[2] ;default: 1'd1 ; */
/*description: When set and PWM_GLOBAL_UP_EN is set  update of active registers
 in PWM operator 0 are enabled*/
#define MCPWM_OP0_UP_EN  (BIT(2))
#define MCPWM_OP0_UP_EN_M  (BIT(2))
#define MCPWM_OP0_UP_EN_V  0x1
#define MCPWM_OP0_UP_EN_S  2
/* MCPWM_GLOBAL_FORCE_UP : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: A toggle (software negation of value of this bit) will trigger
 a forced update of all active registers in MCPWM module*/
#define MCPWM_GLOBAL_FORCE_UP  (BIT(1))
#define MCPWM_GLOBAL_FORCE_UP_M  (BIT(1))
#define MCPWM_GLOBAL_FORCE_UP_V  0x1
#define MCPWM_GLOBAL_FORCE_UP_S  1
/* MCPWM_GLOBAL_UP_EN : R/W ;bitpos:[0] ;default: 1'd1 ; */
/*description: The global enable of update of all active registers in MCPWM module*/
#define MCPWM_GLOBAL_UP_EN  (BIT(0))
#define MCPWM_GLOBAL_UP_EN_M  (BIT(0))
#define MCPWM_GLOBAL_UP_EN_V  0x1
#define MCPWM_GLOBAL_UP_EN_S  0

#define MCMCPWM_INT_ENA_MCPWM_REG(i)          (REG_MCPWM_BASE(i) + 0x0110)
/* MCPWM_CAP2_INT_ENA : R/W ;bitpos:[29] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by captureon channel 2*/
#define MCPWM_CAP2_INT_ENA  (BIT(29))
#define MCPWM_CAP2_INT_ENA_M  (BIT(29))
#define MCPWM_CAP2_INT_ENA_V  0x1
#define MCPWM_CAP2_INT_ENA_S  29
/* MCPWM_CAP1_INT_ENA : R/W ;bitpos:[28] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by captureon channel 1*/
#define MCPWM_CAP1_INT_ENA  (BIT(28))
#define MCPWM_CAP1_INT_ENA_M  (BIT(28))
#define MCPWM_CAP1_INT_ENA_V  0x1
#define MCPWM_CAP1_INT_ENA_S  28
/* MCPWM_CAP0_INT_ENA : R/W ;bitpos:[27] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by captureon channel 0*/
#define MCPWM_CAP0_INT_ENA  (BIT(27))
#define MCPWM_CAP0_INT_ENA_M  (BIT(27))
#define MCPWM_CAP0_INT_ENA_V  0x1
#define MCPWM_CAP0_INT_ENA_S  27
/* MCPWM_FH2_OST_INT_ENA : R/W ;bitpos:[26] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by an one-shot mode action on PWM2*/
#define MCPWM_FH2_OST_INT_ENA  (BIT(26))
#define MCPWM_FH2_OST_INT_ENA_M  (BIT(26))
#define MCPWM_FH2_OST_INT_ENA_V  0x1
#define MCPWM_FH2_OST_INT_ENA_S  26
/* MCPWM_FH1_OST_INT_ENA : R/W ;bitpos:[25] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by an one-shot mode action on PWM0*/
#define MCPWM_FH1_OST_INT_ENA  (BIT(25))
#define MCPWM_FH1_OST_INT_ENA_M  (BIT(25))
#define MCPWM_FH1_OST_INT_ENA_V  0x1
#define MCPWM_FH1_OST_INT_ENA_S  25
/* MCPWM_FH0_OST_INT_ENA : R/W ;bitpos:[24] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by an one-shot mode action on PWM0*/
#define MCPWM_FH0_OST_INT_ENA  (BIT(24))
#define MCPWM_FH0_OST_INT_ENA_M  (BIT(24))
#define MCPWM_FH0_OST_INT_ENA_V  0x1
#define MCPWM_FH0_OST_INT_ENA_S  24
/* MCPWM_FH2_CBC_INT_ENA : R/W ;bitpos:[23] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by an cycle-by-cycle mode action on PWM2*/
#define MCPWM_FH2_CBC_INT_ENA  (BIT(23))
#define MCPWM_FH2_CBC_INT_ENA_M  (BIT(23))
#define MCPWM_FH2_CBC_INT_ENA_V  0x1
#define MCPWM_FH2_CBC_INT_ENA_S  23
/* MCPWM_FH1_CBC_INT_ENA : R/W ;bitpos:[22] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by an cycle-by-cycle mode action on PWM1*/
#define MCPWM_FH1_CBC_INT_ENA  (BIT(22))
#define MCPWM_FH1_CBC_INT_ENA_M  (BIT(22))
#define MCPWM_FH1_CBC_INT_ENA_V  0x1
#define MCPWM_FH1_CBC_INT_ENA_S  22
/* MCPWM_FH0_CBC_INT_ENA : R/W ;bitpos:[21] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by an cycle-by-cycle mode action on PWM0*/
#define MCPWM_FH0_CBC_INT_ENA  (BIT(21))
#define MCPWM_FH0_CBC_INT_ENA_M  (BIT(21))
#define MCPWM_FH0_CBC_INT_ENA_V  0x1
#define MCPWM_FH0_CBC_INT_ENA_S  21
/* MCPWM_OP2_TEB_INT_ENA : R/W ;bitpos:[20] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by a PWM operator 2 TEB event*/
#define MCPWM_OP2_TEB_INT_ENA  (BIT(20))
#define MCPWM_OP2_TEB_INT_ENA_M  (BIT(20))
#define MCPWM_OP2_TEB_INT_ENA_V  0x1
#define MCPWM_OP2_TEB_INT_ENA_S  20
/* MCPWM_OP1_TEB_INT_ENA : R/W ;bitpos:[19] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by a PWM operator 1 TEB event*/
#define MCPWM_OP1_TEB_INT_ENA  (BIT(19))
#define MCPWM_OP1_TEB_INT_ENA_M  (BIT(19))
#define MCPWM_OP1_TEB_INT_ENA_V  0x1
#define MCPWM_OP1_TEB_INT_ENA_S  19
/* MCPWM_OP0_TEB_INT_ENA : R/W ;bitpos:[18] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by a PWM operator 0 TEB event*/
#define MCPWM_OP0_TEB_INT_ENA  (BIT(18))
#define MCPWM_OP0_TEB_INT_ENA_M  (BIT(18))
#define MCPWM_OP0_TEB_INT_ENA_V  0x1
#define MCPWM_OP0_TEB_INT_ENA_S  18
/* MCPWM_OP2_TEA_INT_ENA : R/W ;bitpos:[17] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by a PWM operator 2 TEA event*/
#define MCPWM_OP2_TEA_INT_ENA  (BIT(17))
#define MCPWM_OP2_TEA_INT_ENA_M  (BIT(17))
#define MCPWM_OP2_TEA_INT_ENA_V  0x1
#define MCPWM_OP2_TEA_INT_ENA_S  17
/* MCPWM_OP1_TEA_INT_ENA : R/W ;bitpos:[16] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by a PWM operator 1 TEA event*/
#define MCPWM_OP1_TEA_INT_ENA  (BIT(16))
#define MCPWM_OP1_TEA_INT_ENA_M  (BIT(16))
#define MCPWM_OP1_TEA_INT_ENA_V  0x1
#define MCPWM_OP1_TEA_INT_ENA_S  16
/* MCPWM_OP0_TEA_INT_ENA : R/W ;bitpos:[15] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered by a PWM operator 0 TEA event*/
#define MCPWM_OP0_TEA_INT_ENA  (BIT(15))
#define MCPWM_OP0_TEA_INT_ENA_M  (BIT(15))
#define MCPWM_OP0_TEA_INT_ENA_V  0x1
#define MCPWM_OP0_TEA_INT_ENA_S  15
/* MCPWM_FAULT2_CLR_INT_ENA : R/W ;bitpos:[14] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered when event_f2 ends*/
#define MCPWM_FAULT2_CLR_INT_ENA  (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ENA_M  (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ENA_V  0x1
#define MCPWM_FAULT2_CLR_INT_ENA_S  14
/* MCPWM_FAULT1_CLR_INT_ENA : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered when event_f1 ends*/
#define MCPWM_FAULT1_CLR_INT_ENA  (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ENA_M  (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ENA_V  0x1
#define MCPWM_FAULT1_CLR_INT_ENA_S  13
/* MCPWM_FAULT0_CLR_INT_ENA : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered when event_f0 ends*/
#define MCPWM_FAULT0_CLR_INT_ENA  (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ENA_M  (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ENA_V  0x1
#define MCPWM_FAULT0_CLR_INT_ENA_S  12
/* MCPWM_FAULT2_INT_ENA : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered when event_f2 starts*/
#define MCPWM_FAULT2_INT_ENA  (BIT(11))
#define MCPWM_FAULT2_INT_ENA_M  (BIT(11))
#define MCPWM_FAULT2_INT_ENA_V  0x1
#define MCPWM_FAULT2_INT_ENA_S  11
/* MCPWM_FAULT1_INT_ENA : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered when event_f1 starts*/
#define MCPWM_FAULT1_INT_ENA  (BIT(10))
#define MCPWM_FAULT1_INT_ENA_M  (BIT(10))
#define MCPWM_FAULT1_INT_ENA_V  0x1
#define MCPWM_FAULT1_INT_ENA_S  10
/* MCPWM_FAULT0_INT_ENA : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: The enable bit for interrupt triggered when event_f0 starts*/
#define MCPWM_FAULT0_INT_ENA  (BIT(9))
#define MCPWM_FAULT0_INT_ENA_M  (BIT(9))
#define MCPWM_FAULT0_INT_ENA_V  0x1
#define MCPWM_FAULT0_INT_ENA_S  9
/* MCPWM_TIMER2_TEP_INT_ENA : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered by a PWM timer 2 TEP event*/
#define MCPWM_TIMER2_TEP_INT_ENA  (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ENA_M  (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ENA_V  0x1
#define MCPWM_TIMER2_TEP_INT_ENA_S  8
/* MCPWM_TIMER1_TEP_INT_ENA : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered by a PWM timer 1 TEP event*/
#define MCPWM_TIMER1_TEP_INT_ENA  (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ENA_M  (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ENA_V  0x1
#define MCPWM_TIMER1_TEP_INT_ENA_S  7
/* MCPWM_TIMER0_TEP_INT_ENA : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered by a PWM timer 0 TEP event*/
#define MCPWM_TIMER0_TEP_INT_ENA  (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ENA_M  (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ENA_V  0x1
#define MCPWM_TIMER0_TEP_INT_ENA_S  6
/* MCPWM_TIMER2_TEZ_INT_ENA : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered by a PWM timer 2 TEZ event*/
#define MCPWM_TIMER2_TEZ_INT_ENA  (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ENA_M  (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ENA_V  0x1
#define MCPWM_TIMER2_TEZ_INT_ENA_S  5
/* MCPWM_TIMER1_TEZ_INT_ENA : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered by a PWM timer 1 TEZ event*/
#define MCPWM_TIMER1_TEZ_INT_ENA  (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ENA_M  (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ENA_V  0x1
#define MCPWM_TIMER1_TEZ_INT_ENA_S  4
/* MCPWM_TIMER0_TEZ_INT_ENA : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered by a PWM timer 0 TEZ event*/
#define MCPWM_TIMER0_TEZ_INT_ENA  (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ENA_M  (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ENA_V  0x1
#define MCPWM_TIMER0_TEZ_INT_ENA_S  3
/* MCPWM_TIMER2_STOP_INT_ENA : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered when timer 2 stops*/
#define MCPWM_TIMER2_STOP_INT_ENA  (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ENA_M  (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ENA_V  0x1
#define MCPWM_TIMER2_STOP_INT_ENA_S  2
/* MCPWM_TIMER1_STOP_INT_ENA : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered when timer 1 stops*/
#define MCPWM_TIMER1_STOP_INT_ENA  (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ENA_M  (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ENA_V  0x1
#define MCPWM_TIMER1_STOP_INT_ENA_S  1
/* MCPWM_TIMER0_STOP_INT_ENA : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: The enable bit for interrupt triggered when timer 0 stops*/
#define MCPWM_TIMER0_STOP_INT_ENA  (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ENA_M  (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ENA_V  0x1
#define MCPWM_TIMER0_STOP_INT_ENA_S  0

